// GREEK STEMMER FUNCTION
step1list = new Array();
step1list["ΦΑΓΙΑ"]="ΦΑ";
step1list["ΦΑΓΙΟΥ"]="ΦΑ";
step1list["ΦΑΓΙΩΝ"]="ΦΑ";
step1list["ΣΚΑΓΙΑ"]="ΣΚΑ";
step1list["ΣΚΑΓΙΟΥ"]="ΣΚΑ";
step1list["ΣΚΑΓΙΩΝ"]="ΣΚΑ";
step1list["ΟΛΟΓΙΟΥ"]="ΟΛΟ";
step1list["ΟΛΟΓΙΑ"]="ΟΛΟ";
step1list["ΟΛΟΓΙΩΝ"]="ΟΛΟ";
step1list["ΣΟΓΙΟΥ"]="ΣΟ";
step1list["ΣΟΓΙΑ"]="ΣΟ";
step1list["ΣΟΓΙΩΝ"]="ΣΟ";
step1list["ΤΑΤΟΓΙΑ"]="ΤΑΤΟ";
step1list["ΤΑΤΟΓΙΟΥ"]="ΤΑΤΟ";
step1list["ΤΑΤΟΓΙΩΝ"]="ΤΑΤΟ";
step1list["ΚΡΕΑΣ"]="ΚΡΕ";
step1list["ΚΡΕΑΤΟΣ"]="ΚΡΕ";
step1list["ΚΡΕΑΤΑ"]="ΚΡΕ";
step1list["ΚΡΕΑΤΩΝ"]="ΚΡΕ";
step1list["ΠΕΡΑΣ"]="ΠΕΡ";
step1list["ΠΕΡΑΤΟΣ"]="ΠΕΡ";
step1list["ΠΕΡΑΤΑ"]="ΠΕΡ";
step1list["ΠΕΡΑΤΩΝ"]="ΠΕΡ";
step1list["ΤΕΡΑΣ"]="ΤΕΡ";
step1list["ΤΕΡΑΤΟΣ"]="ΤΕΡ";
step1list["ΤΕΡΑΤΑ"]="ΤΕΡ";
step1list["ΤΕΡΑΤΩΝ"]="ΤΕΡ";
step1list["ΦΩΣ"]="ΦΩ";
step1list["ΦΩΤΟΣ"]="ΦΩ";
step1list["ΦΩΤΑ"]="ΦΩ";
step1list["ΦΩΤΩΝ"]="ΦΩ";
step1list["ΚΑΘΕΣΤΩΣ"]="ΚΑΘΕΣΤ";
step1list["ΚΑΘΕΣΤΩΤΟΣ"]="ΚΑΘΕΣΤ";
step1list["ΚΑΘΕΣΤΩΤΑ"]="ΚΑΘΕΣΤ";
step1list["ΚΑΘΕΣΤΩΤΩΝ"]="ΚΑΘΕΣΤ";
step1list["ΓΕΓΟΝΟΣ"]="ΓΕΓΟΝ";
step1list["ΓΕΓΟΝΟΤΟΣ"]="ΓΕΓΟΝ";
step1list["ΓΕΓΟΝΟΤΑ"]="ΓΕΓΟΝ";
step1list["ΓΕΓΟΝΟΤΩΝ"]="ΓΕΓΟΝ";

v = "[ΑΕΗΙΟΥΩ]";  // vowel
v2 = "[ΑΕΗΙΟΩ]" //vowel without Y

function stemWord(w) {
  var stem;
  var suffix;
  var firstch;
  var origword = w;
  test1 = new Boolean(true);

  if (w.length < 4) { return w; }

    var re;
    var re2;
    var re3;
    var re4;


//Step1

re = /(.*)(ΦΑΓΙΑ|ΦΑΓΙΟΥ|ΦΑΓΙΩΝ|ΣΚΑΓΙΑ|ΣΚΑΓΙΟΥ|ΣΚΑΓΙΩΝ|ΟΛΟΓΙΟΥ|ΟΛΟΓΙΑ|ΟΛΟΓΙΩΝ|ΣΟΓΙΟΥ|ΣΟΓΙΑ|ΣΟΓΙΩΝ|ΤΑΤΟΓΙΑ|ΤΑΤΟΓΙΟΥ|ΤΑΤΟΓΙΩΝ|ΚΡΕΑΣ|ΚΡΕΑΤΟΣ|ΚΡΕΑΤΑ|ΚΡΕΑΤΩΝ|ΠΕΡΑΣ|ΠΕΡΑΤΟΣ|ΠΕΡΑΤΑ|ΠΕΡΑΤΩΝ|ΤΕΡΑΣ|ΤΕΡΑΤΟΣ|ΤΕΡΑΤΑ|ΤΕΡΑΤΩΝ|ΦΩΣ|ΦΩΤΟΣ|ΦΩΤΑ|ΦΩΤΩΝ|ΚΑΘΕΣΤΩΣ|ΚΑΘΕΣΤΩΤΟΣ|ΚΑΘΕΣΤΩΤΑ|ΚΑΘΕΣΤΩΤΩΝ|ΓΕΓΟΝΟΣ|ΓΕΓΟΝΟΤΟΣ|ΓΕΓΟΝΟΤΑ|ΓΕΓΟΝΟΤΩΝ)$/;

  if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    suffix = fp[2];
    w = stem + step1list[suffix];
    test1 = false;
  }



  // Step 2a
    re = /^(.+?)(ΑΔΕΣ|ΑΔΩΝ)$/;


  if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;

reg1 = /(ΟΚ|ΜΑΜ|ΜΑΝ|ΜΠΑΜΠ|ΠΑΤΕΡ|ΓΙΑΓΙ|ΝΤΑΝΤ|ΚΥΡ|ΘΕΙ|ΠΕΘΕΡ)$/;

if (!(reg1.test(w))) {w = w + "ΑΔ";}

}

  //Step 2b
  re2 = /^(.+?)(ΕΔΕΣ|ΕΔΩΝ)$/;

  if (re2.test(w)) {
    var fp = re2.exec(w);
    stem = fp[1];
    w = stem;

exept2 = /(ΟΠ|ΙΠ|ΕΜΠ|ΥΠ|ΓΗΠ|ΔΑΠ|ΚΡΑΣΠ|ΜΙΛ)$/;

if (exept2.test(w)) {w = w + "ΕΔ";}

}

  //Step 2c
  re3 = /^(.+?)(ΟΥΔΕΣ|ΟΥΔΩΝ)$/;

  if (re3.test(w)) {
    var fp = re3.exec(w);
    stem = fp[1];
    w = stem;

exept3 = /(ΑΡΚ|ΚΑΛΙΑΚ|ΠΕΤΑΛ|ΛΙΧ|ΠΛΕΞ|ΣΚ|Σ|ΦΛ|ΦΡ|ΒΕΛ|ΛΟΥΛ|ΧΝ|ΣΠ|ΤΡΑΓ|ΦΕ)$/;

if (exept3.test(w)) {w = w + "ΟΥΔ";}

}


  //Step 2d
  re4 = /^(.+?)(ΕΩΣ|ΕΩΝ)$/;

  if (re4.test(w)) {
    var fp = re4.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

exept4 = /^(Θ|Δ|ΕΛ|ΓΑΛ|Ν|Π|ΙΔ|ΠΑΡ)$/;

if (exept4.test(w)) {
  w = w + "Ε";

  }
}

  //Step 3
  re = /^(.+?)(ΙΑ|ΙΟΥ|ΙΩΝ)$/;

  if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    re2 = new RegExp (v+"$");
    test1 = false;

      if (re2.test(w)) {
        w = stem + "Ι";
      }

  }


  //Step 4
  re = /^(.+?)(ΙΚΑ|ΙΚΟ|ΙΚΟΥ|ΙΚΩΝ)$/;

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  re2 = new RegExp (v+"$");
  exept5 = /^(ΑΛ|ΑΔ|ΕΝΔ|ΑΜΑΝ|ΑΜΜΟΧΑΛ|ΗΘ|ΑΝΗΘ|ΑΝΤΙΔ|ΦΥΣ|ΒΡΩΜ|ΓΕΡ|ΕΞΩΔ|ΚΑΛΠ|ΚΑΛΛΙΝ|ΚΑΤΑΔ|ΜΟΥΛ|ΜΠΑΝ|ΜΠΑΓΙΑΤ|ΜΠΟΛ|ΜΠΟΣ|ΝΙΤ|ΞΙΚ|ΣΥΝΟΜΗΛ|ΠΕΤΣ|ΠΙΤΣ|ΠΙΚΑΝΤ|ΠΛΙΑΤΣ|ΠΟΣΤΕΛΝ|ΠΡΩΤΟΔ|ΣΕΡΤ|ΣΥΝΑΔ|ΤΣΑΜ|ΥΠΟΔ|ΦΙΛΟΝ|ΦΥΛΟΔ|ΧΑΣ)$/;

  if ((exept5.test(w)) || (re2.test(w))){
  w = w + "ΙΚ";
  }
}

  //step 5a
  re = /^(.+?)(ΑΜΕ)$/;
  re2 = /^(.+?)(ΑΓΑΜΕ|ΗΣΑΜΕ|ΟΥΣΑΜΕ|ΗΚΑΜΕ|ΗΘΗΚΑΜΕ)$/;
  if (w == "ΑΓΑΜΕ"){w = "ΑΓΑΜ";}

  if (re2.test(w)) {
    var fp = re2.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;
}



  if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept6 = /^(ΑΝΑΠ|ΑΠΟΘ|ΑΠΟΚ|ΑΠΟΣΤ|ΒΟΥΒ|ΞΕΘ|ΟΥΛ|ΠΕΘ|ΠΙΚΡ|ΠΟΤ|ΣΙΧ|Χ)$/;

  if (exept6.test(w)){
  w = w + "ΑΜ";
  }
}


  //Step 5b
  re2 = /^(.+?)(ΑΝΕ)$/;
  re3 = /^(.+?)(ΑΓΑΝΕ|ΗΣΑΝΕ|ΟΥΣΑΝΕ|ΙΟΝΤΑΝΕ|ΙΟΤΑΝΕ|ΙΟΥΝΤΑΝΕ|ΟΝΤΑΝΕ|ΟΤΑΝΕ|ΟΥΝΤΑΝΕ|ΗΚΑΝΕ|ΗΘΗΚΑΝΕ)$/;

  if (re3.test(w)) {
    var fp = re3.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

    re3 = /^(ΤΡ|ΤΣ)$/;

    if (re3.test(w)) {
    w = w + "ΑΓΑΝ";
    }
  }


if (re2.test(w)) {
    var fp = re2.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  re2 = new RegExp (v2 +"$");
  exept7 = /^(ΒΕΤΕΡ|ΒΟΥΛΚ|ΒΡΑΧΜ|Γ|ΔΡΑΔΟΥΜ|Θ|ΚΑΛΠΟΥΖ|ΚΑΣΤΕΛ|ΚΟΡΜΟΡ|ΛΑΟΠΛ|ΜΩΑΜΕΘ|Μ|ΜΟΥΣΟΥΛΜ|Ν|ΟΥΛ|Π|ΠΕΛΕΚ|ΠΛ|ΠΟΛΙΣ|ΠΟΡΤΟΛ|ΣΑΡΑΚΑΤΣ|ΣΟΥΛΤ|ΤΣΑΡΛΑΤ|ΟΡΦ|ΤΣΙΓΓ|ΤΣΟΠ|ΦΩΤΟΣΤΕΦ|Χ|ΨΥΧΟΠΛ|ΑΓ|ΟΡΦ|ΓΑΛ|ΓΕΡ|ΔΕΚ|ΔΙΠΛ|ΑΜΕΡΙΚΑΝ|ΟΥΡ|ΠΙΘ|ΠΟΥΡΙΤ|Σ|ΖΩΝΤ|ΙΚ|ΚΑΣΤ|ΚΟΠ|ΛΙΧ|ΛΟΥΘΗΡ|ΜΑΙΝΤ|ΜΕΛ|ΣΙΓ|ΣΠ|ΣΤΕΓ|ΤΡΑΓ|ΤΣΑΓ|Φ|ΕΡ|ΑΔΑΠ|ΑΘΙΓΓ|ΑΜΗΧ|ΑΝΙΚ|ΑΝΟΡΓ|ΑΠΗΓ|ΑΠΙΘ|ΑΤΣΙΓΓ|ΒΑΣ|ΒΑΣΚ|ΒΑΘΥΓΑΛ|ΒΙΟΜΗΧ|ΒΡΑΧΥΚ|ΔΙΑΤ|ΔΙΑΦ|ΕΝΟΡΓ|ΘΥΣ|ΚΑΠΝΟΒΙΟΜΗΧ|ΚΑΤΑΓΑΛ|ΚΛΙΒ|ΚΟΙΛΑΡΦ|ΛΙΒ|ΜΕΓΛΟΒΙΟΜΗΧ|ΜΙΚΡΟΒΙΟΜΗΧ|ΝΤΑΒ|ΞΗΡΟΚΛΙΒ|ΟΛΙΓΟΔΑΜ|ΟΛΟΓΑΛ|ΠΕΝΤΑΡΦ|ΠΕΡΗΦ|ΠΕΡΙΤΡ|ΠΛΑΤ|ΠΟΛΥΔΑΠ|ΠΟΛΥΜΗΧ|ΣΤΕΦ|ΤΑΒ|ΤΕΤ|ΥΠΕΡΗΦ|ΥΠΟΚΟΠ|ΧΑΜΗΛΟΔΑΠ|ΨΗΛΟΤΑΒ)$/;

  if ((re2.test(w)) || (exept7.test(w))){
  w = w + "ΑΝ";
  }
}


  //Step 5c
  re3 = /^(.+?)(ΕΤΕ)$/;
  re4 = /^(.+?)(ΗΣΕΤΕ)$/;

  if (re4.test(w)) {
    var fp = re4.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;
  }




if (re3.test(w)) {
    var fp = re3.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  re3 = new RegExp (v2 +"$");
  exept8 =  /(ΟΔ|ΑΙΡ|ΦΟΡ|ΤΑΘ|ΔΙΑΘ|ΣΧ|ΕΝΔ|ΕΥΡ|ΤΙΘ|ΥΠΕΡΘ|ΡΑΘ|ΕΝΘ|ΡΟΘ|ΣΘ|ΠΥΡ|ΑΙΝ|ΣΥΝΔ|ΣΥΝ|ΣΥΝΘ|ΧΩΡ|ΠΟΝ|ΒΡ|ΚΑΘ|ΕΥΘ|ΕΚΘ|ΝΕΤ|ΡΟΝ|ΑΡΚ|ΒΑΡ|ΒΟΛ|ΩΦΕΛ)$/;
  exept9 = /^(ΑΒΑΡ|ΒΕΝ|ΕΝΑΡ|ΑΒΡ|ΑΔ|ΑΘ|ΑΝ|ΑΠΛ|ΒΑΡΟΝ|ΝΤΡ|ΣΚ|ΚΟΠ|ΜΠΟΡ|ΝΙΦ|ΠΑΓ|ΠΑΡΑΚΑΛ|ΣΕΡΠ|ΣΚΕΛ|ΣΥΡΦ|ΤΟΚ|Υ|Δ|ΕΜ|ΘΑΡΡ|Θ)$/;

  if ((re3.test(w)) || (exept8.test(w)) || (exept9.test(w))){
  w = w + "ΕΤ";
  }
}

  //Step 5d
  re = /^(.+?)(ΟΝΤΑΣ|ΩΝΤΑΣ)$/;

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept10 = /^(ΑΡΧ)$/;
  exept11 = /(ΚΡΕ)$/;
  if (exept10.test(w)){
  w = w + "ΟΝΤ";
  }
  if (exept11.test(w)){
  w = w + "ΩΝΤ";
  }
}

  //Step 5e
  re = /^(.+?)(ΟΜΑΣΤΕ|ΙΟΜΑΣΤΕ)$/;

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept11 = /^(ΟΝ)$/;

  if (exept11.test(w)){
  w = w + "ΟΜΑΣΤ";
  }
}

  //Step 5f
  re = /^(.+?)(ΕΣΤΕ)$/;
  re2 = /^(.+?)(ΙΕΣΤΕ)$/;

if (re2.test(w)) {
    var fp = re2.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  re2 = /^(Π|ΑΠ|ΣΥΜΠ|ΑΣΥΜΠ|ΑΚΑΤΑΠ|ΑΜΕΤΑΜΦ)$/;

  if (re2.test(w)){
  w = w + "ΙΕΣΤ";
  }
}

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept12 = /^(ΑΛ|ΑΡ|ΕΚΤΕΛ|Ζ|Μ|Ξ|ΠΑΡΑΚΑΛ|ΑΡ|ΠΡΟ|ΝΙΣ)$/;

  if (exept12.test(w)){
  w = w + "ΕΣΤ";
  }
}


  //Step 5g
  re = /^(.+?)(ΗΚΑ|ΗΚΕΣ|ΗΚΕ)$/;
  re2 = /^(.+?)(ΗΘΗΚΑ|ΗΘΗΚΕΣ|ΗΘΗΚΕ)$/;

  if (re2.test(w)){
    var fp = re2.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;
  }

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept13 = /(ΣΚΩΛ|ΣΚΟΥΛ|ΝΑΡΘ|ΣΦ|ΟΘ|ΠΙΘ)$/;
  exept14 = /^(ΔΙΑΘ|Θ|ΠΑΡΑΚΑΤΑΘ|ΠΡΟΣΘ|ΣΥΝΘ|)$/;

  if ((exept13.test(w)) || (exept14.test(w))){
  w = w + "ΗΚ";
  }
}


  //Step 5h
  re = /^(.+?)(ΟΥΣΑ|ΟΥΣΕΣ|ΟΥΣΕ)$/;

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept15 = /^(ΦΑΡΜΑΚ|ΧΑΔ|ΑΓΚ|ΑΝΑΡΡ|ΒΡΟΜ|ΕΚΛΙΠ|ΛΑΜΠΙΔ|ΛΕΧ|Μ|ΠΑΤ|Ρ|Λ|ΜΕΔ|ΜΕΣΑΖ|ΥΠΟΤΕΙΝ|ΑΜ|ΑΙΘ|ΑΝΗΚ|ΔΕΣΠΟΖ|ΕΝΔΙΑΦΕΡ|ΔΕ|ΔΕΥΤΕΡΕΥ|ΚΑΘΑΡΕΥ|ΠΛΕ|ΤΣΑ)$/;
  exept16 = /(ΠΟΔΑΡ|ΒΛΕΠ|ΠΑΝΤΑΧ|ΦΡΥΔ|ΜΑΝΤΙΛ|ΜΑΛΛ|ΚΥΜΑΤ|ΛΑΧ|ΛΗΓ|ΦΑΓ|ΟΜ|ΠΡΩΤ)$/;

  if ((exept15.test(w)) || (exept16.test(w))){
  w = w + "ΟΥΣ";
  }
}


  //Step 5i
  re = /^(.+?)(ΑΓΑ|ΑΓΕΣ|ΑΓΕ)$/;

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept17 = /^(ΨΟΦ|ΝΑΥΛΟΧ)$/;
  exept20 = /(ΚΟΛΛ)$/;
  exept18 = /^(ΑΒΑΣΤ|ΠΟΛΥΦ|ΑΔΗΦ|ΠΑΜΦ|Ρ|ΑΣΠ|ΑΦ|ΑΜΑΛ|ΑΜΑΛΛΙ|ΑΝΥΣΤ|ΑΠΕΡ|ΑΣΠΑΡ|ΑΧΑΡ|ΔΕΡΒΕΝ|ΔΡΟΣΟΠ|ΞΕΦ|ΝΕΟΠ|ΝΟΜΟΤ|ΟΛΟΠ|ΟΜΟΤ|ΠΡΟΣΤ|ΠΡΟΣΩΠΟΠ|ΣΥΜΠ|ΣΥΝΤ|Τ|ΥΠΟΤ|ΧΑΡ|ΑΕΙΠ|ΑΙΜΟΣΤ|ΑΝΥΠ|ΑΠΟΤ|ΑΡΤΙΠ|ΔΙΑΤ|ΕΝ|ΕΠΙΤ|ΚΡΟΚΑΛΟΠ|ΣΙΔΗΡΟΠ|Λ|ΝΑΥ|ΟΥΛΑΜ|ΟΥΡ|Π|ΤΡ|Μ)$/;
  exept19 = /(ΟΦ|ΠΕΛ|ΧΟΡΤ|ΛΛ|ΣΦ|ΡΠ|ΦΡ|ΠΡ|ΛΟΧ|ΣΜΗΝ)$/;

  if (((exept18.test(w)) || (exept19.test(w)))  && !((exept17.test(w)) || (exept20.test(w)))){
  w = w + "ΑΓ";
  }
}


  //Step 5j
  re = /^(.+?)(ΗΣΕ|ΗΣΟΥ|ΗΣΑ)$/;

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept21 = /^(Ν|ΧΕΡΣΟΝ|ΔΩΔΕΚΑΝ|ΕΡΗΜΟΝ|ΜΕΓΑΛΟΝ|ΕΠΤΑΝ)$/;

  if (exept21.test(w)){
  w = w + "ΗΣ";
  }
}

  //Step 5k
  re = /^(.+?)(ΗΣΤΕ)$/;

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept22 = /^(ΑΣΒ|ΣΒ|ΑΧΡ|ΧΡ|ΑΠΛ|ΑΕΙΜΝ|ΔΥΣΧΡ|ΕΥΧΡ|ΚΟΙΝΟΧΡ|ΠΑΛΙΜΨ)$/;

  if (exept22.test(w)){
  w = w + "ΗΣΤ";
  }
}

  //Step 5l
  re = /^(.+?)(ΟΥΝΕ|ΗΣΟΥΝΕ|ΗΘΟΥΝΕ)$/;

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept23 = /^(Ν|Ρ|ΣΠΙ|ΣΤΡΑΒΟΜΟΥΤΣ|ΚΑΚΟΜΟΥΤΣ|ΕΞΩΝ)$/;

  if (exept23.test(w)){
  w = w + "ΟΥΝ";
  }
}

  //Step 5l
  re = /^(.+?)(ΟΥΜΕ|ΗΣΟΥΜΕ|ΗΘΟΥΜΕ)$/;

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
    test1 = false;

  exept24 = /^(ΠΑΡΑΣΟΥΣ|Φ|Χ|ΩΡΙΟΠΛ|ΑΖ|ΑΛΛΟΣΟΥΣ|ΑΣΟΥΣ)$/;

  if (exept24.test(w)){
  w = w + "ΟΥΜ";
  }
}



  // Step 6

re=/^(.+?)(ΜΑΤΑ|ΜΑΤΩΝ|ΜΑΤΟΣ)$/;
re2 = /^(.+?)(Α|ΑΓΑΤΕ|ΑΓΑΝ|ΑΕΙ|ΑΜΑΙ|ΑΝ|ΑΣ|ΑΣΑΙ|ΑΤΑΙ|ΑΩ|Ε|ΕΙ|ΕΙΣ|ΕΙΤΕ|ΕΣΑΙ|ΕΣ|ΕΤΑΙ|Ι|ΙΕΜΑΙ|ΙΕΜΑΣΤΕ|ΙΕΤΑΙ|ΙΕΣΑΙ|ΙΕΣΑΣΤΕ|ΙΟΜΑΣΤΑΝ|ΙΟΜΟΥΝ|ΙΟΜΟΥΝΑ|ΙΟΝΤΑΝ|ΙΟΝΤΟΥΣΑΝ|ΙΟΣΑΣΤΑΝ|ΙΟΣΑΣΤΕ|ΙΟΣΟΥΝ|ΙΟΣΟΥΝΑ|ΙΟΤΑΝ|ΙΟΥΜΑ|ΙΟΥΜΑΣΤΕ|ΙΟΥΝΤΑΙ|ΙΟΥΝΤΑΝ|Η|ΗΔΕΣ|ΗΔΩΝ|ΗΘΕΙ|ΗΘΕΙΣ|ΗΘΕΙΤΕ|ΗΘΗΚΑΤΕ|ΗΘΗΚΑΝ|ΗΘΟΥΝ|ΗΘΩ|ΗΚΑΤΕ|ΗΚΑΝ|ΗΣ|ΗΣΑΝ|ΗΣΑΤΕ|ΗΣΕΙ|ΗΣΕΣ|ΗΣΟΥΝ|ΗΣΩ|Ο|ΟΙ|ΟΜΑΙ|ΟΜΑΣΤΑΝ|ΟΜΟΥΝ|ΟΜΟΥΝΑ|ΟΝΤΑΙ|ΟΝΤΑΝ|ΟΝΤΟΥΣΑΝ|ΟΣ|ΟΣΑΣΤΑΝ|ΟΣΑΣΤΕ|ΟΣΟΥΝ|ΟΣΟΥΝΑ|ΟΤΑΝ|ΟΥ|ΟΥΜΑΙ|ΟΥΜΑΣΤΕ|ΟΥΝ|ΟΥΝΤΑΙ|ΟΥΝΤΑΝ|ΟΥΣ|ΟΥΣΑΝ|ΟΥΣΑΤΕ|Υ|ΥΣ|Ω|ΩΝ)$/;

if (re.test(w)) {
    var fp = re.exec(w);
    stem = fp[1];
    w = stem + "ΜΑ";
}

  if ((re2.test(w))&&(test1)){
    var fp = re2.exec(w);
    stem = fp[1];
    w = stem;

  }

  // Step 7 (ΠΑΡΑΘΕΤΙΚΑ)

re = /^(.+?)(ΕΣΤΕΡ|ΕΣΤΑΤ|ΟΤΕΡ|ΟΤΑΤ|ΥΤΕΡ|ΥΤΑΤ|ΩΤΕΡ|ΩΤΑΤ)$/;

  if (re.test(w)){
    var fp = re.exec(w);
    stem = fp[1];
    w = stem;
  }

return w;
};

// create a new pipeline function to be used by lunr
greekStemmer = function (word) {
  return stemWord(word.toUpperCase()).toLowerCase(); // the word needs to be uppercase so we convert our input because lunr converts everything to lowercase by default.
};

var idx = lunr(function () {
  this.field('title', {boost: 10})
  this.field('excerpt')
  this.field('categories')
  this.field('tags')
  this.ref('id')

  this.pipeline.remove(lunr.trimmer) // it doesn't work well with non-latin characters
  this.pipeline.add(greekStemmer)
  this.pipeline.remove(lunr.stemmer)
});



  
    
    
      idx.add({
        title: "Αλέξανδρος Πανάρετος",
        excerpt: "education:\n\n  “BEng Software Engineering, Univerisity of Wales, Aberystwyth”\n  “MSc E-Commerce Technology, Essex University”\n\n\n",
        categories: [],
        tags: ["Διαδικτυακός προγραμματισμός","Βάσεις Δεδομένων","Συστήματα Διαχείρησης Περιεχομένου","Κοινωνικά & Συνεργατικά Δίκτυα"],
        id: 0
      });
      
      
      idx.add({
        title: "Αθανάσιος Αλεξίου",
        excerpt: "### education:\n - PhD in Bioinformatics, Ionian University \n",
        categories: [],
        tags: ["Bioinformatics"],
        id: 1
      });
      
      
      idx.add({
        title: "Έλενα Λάσκαρι",
        excerpt: "\n",
        categories: [],
        tags: [],
        id: 2
      });
      
      
      idx.add({
        title: "Βαρβάρα Γαρνέλη",
        excerpt: "education: BSc in Informatics, Athens University of Economics and Business MSc in Informatics and Humanistic Studies, Ionian University PhD in...",
        categories: [],
        tags: ["Computing Education"],
        id: 3
      });
      
      
      idx.add({
        title: "Κωνσταντίνος Γιαννάκης",
        excerpt: "education: Bachelor of Science (BSc),Ionian University, Dept. of Informatics Master of Science (MSc),Ionian University, Dept. of Informatics PhD in the...",
        categories: [],
        tags: ["Theoretical Computer Science"],
        id: 4
      });
      
      
      idx.add({
        title: "Ιωάννης Καρύδης",
        excerpt: "education: “Phd , Auth, thesis: Mining and retrieval methods for acoustic and symbolic musical data.” “MSc Advanced Methods in Computer...",
        categories: ["HILab"],
        tags: ["Συστήματα Υποστήριξης Αποφάσεων","Επεξεργασία Ομιλίας και Ήχου"],
        id: 5
      });
      
      
      idx.add({
        title: "Πάτρικ Μικάλεφ",
        excerpt: "education: Bachelor of Science (BSc),Ionian University, Dept. of Informatics Master of Science in Business Informatics(MSc),Utrecht University PhD in IT Strategy,Ionian...",
        categories: [],
        tags: ["IT Strategy"],
        id: 6
      });
      
      
      idx.add({
        title: "Ηλίας Παππάς",
        excerpt: "education:\n\n  PhD in E-Commerce,Ionian University, Dept. of Informatics\n\n",
        categories: [],
        tags: ["E-Commerce"],
        id: 7
      });
      
      
      idx.add({
        title: "Γεώργιος Παξινός",
        excerpt: "education:\n",
        categories: [],
        tags: ["Neuroscience"],
        id: 8
      });
      
      
      idx.add({
        title: "Μαρία Ψύχα",
        excerpt: "education: Bachelor of Science (BSc),Ionian University, Dept. of Informatics Master of Science (MSc),Ionian University, Dept. of Informatics PhD in Bioinformatics,Ionian...",
        categories: [],
        tags: ["Bioinformatics"],
        id: 9
      });
      
      
      idx.add({
        title: "Σπύρος Βούλγαρης",
        excerpt: "education:\n\n  “Πτυχίο, Τμήμα Ηλεκτρολόγων Μηχανικών και Μηχ. Η/Υ, Εθνικό Μετσόβιο Πολυτεχνείο”\n  “Μεταπτυχιακό, Τμήμα Αρχειονομίας και Βιβλιοθηκονομίας, Ιόνιο Παναεπιστήμιο”\n\n\n",
        categories: [],
        tags: [],
        id: 10
      });
      
      
      idx.add({
        title: "Σωτηρία-Σοφία Αρωνιάδα",
        excerpt: "\n",
        categories: [],
        tags: [],
        id: 11
      });
      
      
      idx.add({
        title: "Bernd Wegner",
        excerpt: "education:\n",
        categories: [],
        tags: ["Mathematics"],
        id: 12
      });
      
      
  

  

  
    
    
      idx.add({
        title: "Τεχνητή Νοημοσύνη",
        excerpt: "Βιβλιογραφία: ““ΤΕΧΝΗΤΗ ΝΟΗΜΟΣΥΝΗ: ΜΙΑ ΣΥΓΧΡΟΝΗ ΠΡΟΣΕΓΓΙΣΗ”, Russell S., Norvig P. ΕΚΔΟΣΕΙΣ ΚΛΕΙΔΑΡΙΘΜΟΣ ΕΠΕ, ISBN 960-209-873-2, 2005” eudoxus link ““Τεχνητή Nοημοσύνη”,...",
        categories: [],
        tags: [],
        id: 13
      });
      
      
      idx.add({
        title: "Αλγόριθμοι",
        excerpt: "Βιβλιογραφία: ““ΕΙΣΑΓΩΓΗ ΣΤΟΥΣ ΑΛΓΟΡΙΘΜΟΥΣ ΤΟΜΟΣ Ι”, CORMEN T.H., LEISERSON C.E., RIVEST R.L., STEIN C., Εκδόσεις ΙΤΕ-ΠΑΝΕΠΙΣΤΗΜΙΑΚΕΣ ΕΚΔΟΣΕΙΣ ΚΡΗΤΗΣ, ISBN 978-960-524-225-1,...",
        categories: [],
        tags: [],
        id: 14
      });
      
      
      idx.add({
        title: "Οργάνωση και Διοίκηση Επιχειρησέων",
        excerpt: "Βιβλιογραφία:\n\n  ““ΟΡΓΑΝΩΣΙΑΚΗ ΘΕΩΡΙΑ ΚΑΙ ΣΧΕΔΙΑΣΜΟΣ”, RICHARD L. DAFT, Εκδόσεις Κλειδάριθμος, ISBN 960-209-846-5, 2005” eudoxus link\n\n\n",
        categories: [],
        tags: [],
        id: 15
      });
      
      
      idx.add({
        title: "Διαχείριση Μεγάλου Όγκου Δεδομένων ",
        excerpt: "Βιβλιογραφία: “Εξόρυξη από Μεγάλα Σύνολα Δεδομένων, Anand Rajaraman, Jeffrey David Ullman”eudoxus link ” Η ΜΕΘΟΔΟΣ PAGERANK ΤΗΣ GOOGLE ΚΑΙ ΑΛΛΑ...",
        categories: [],
        tags: [],
        id: 16
      });
      
      
      idx.add({
        title: "Μαθηματικός Λογισμός",
        excerpt: "Βιβλιογραφία: “Απειροστικός λογισμός, Παναγιωτόπουλος Αντώνιος Χ., Σαπουνάκης Αριστείδης, Εκδόσεις Σταμούλη, 1989” “Απειροστικός λογισμός, Παναγιωτόπουλος Αντώνιος Χ., Σαπουνάκης Αριστείδης, Εκδόσεις Σταμούλη,...",
        categories: [],
        tags: [],
        id: 17
      });
      
      
      idx.add({
        title: "Μεταγλωττιστές",
        excerpt: "Βιβλιογραφία: ” Μεταγλωττιστές, Alfred V. Aho, Monica S. Lam, Ravi Sethi, Jeffrey D. Ullman” eudoxus link ” Μεταγλωττιστές, Παπασπύρου Νικόλαος...",
        categories: [],
        tags: [],
        id: 18
      });
      
      
      idx.add({
        title: "Θεωρία Υπλογισμού",
        excerpt: "Βιβλιογραφία: ““ΕΙΣΑΓΩΓΗ ΣΤΗ ΘΕΩΡΙΑ ΥΠΟΛΟΓΙΣΜΟΥ”, SIPSER MICHAEL, Εκδόσεις ΙΤΕ-ΠΑΝΕΠΙΣΤΗΜΙΑΚΕΣ ΕΚΔΟΣΕΙΣ ΚΡΗΤΗΣ, ISBN 978-960-524-243-5, 2009”eudoxus link ““Στοιχεία θεωρίας υπολογισμού”, Lewis Harry...",
        categories: [],
        tags: [],
        id: 19
      });
      
      
      idx.add({
        title: "Αρχιτεκτονική Υπολογιστών",
        excerpt: "Βιβλιογραφία: “D.A.Patterson &amp; J.L.Hennessy, “Οργάνωση και Σχεδίαση Υπολογιστών (Τόμος Α’)” , 4η έκδοση, Κλειδάριθμος, 2010.” eudoxus link “W. Stallings, “Οργάνωση...",
        categories: [],
        tags: [],
        id: 20
      });
      
      
      idx.add({
        title: "Γραφικά με Υπολογιστές",
        excerpt: "Βιβλιογραφία: “Γραφικά και Οπτικοποίηση”, Θεοχάρης Θ., Πλατής Ν., Παπαϊωάννου Γ., Πατρικαλάκης Ν., Εκδόσεις Συμμετρία, ISBN 978-960-266-296-0, 2010”eudoxus link “Γραφικά με...",
        categories: [],
        tags: [],
        id: 21
      });
      
      
      idx.add({
        title: "Προγραμματισμός Υπολογιστών",
        excerpt: "Βιβλιογραφία: “C Προγραμματισμός”, 6η Έκδοση, Paul Deitel, Harvey Deitel, Εκδόσεις Α. Γκιούρδα &amp; ΣΙΑ ΟΕ, ISBN 978-960-512-5912, 2011”eudoxus link “ΜΑΘΕΤΕ...",
        categories: [],
        tags: [],
        id: 22
      });
      
      
      idx.add({
        title: "Διδακτική της Πληροφορικής",
        excerpt: "Βιβλιογραφία: “Εισαγωγή στη διδακτική της πληροφορικής, Βασίλης Ι. Κόμης, Εκδόσεις Κλειδάριθμος”eudoxus link “Εισαγωγή στη διδακτική της πληροφορικής, Ν. Αλεξανδρής, Β....",
        categories: [],
        tags: [],
        id: 23
      });
      
      
      idx.add({
        title: "Κρυπτογραφία",
        excerpt: "Βιβλιογραφία: “Κρυπτογραφία και ασφάλεια δικτύων – αρχες και εφαρμογες. William Stallings, ΙΩΝ 2012.”eudoxus link “Σύγχρονη Κρυπτογραφία – Θεωρία και Εφαρμογές....",
        categories: [],
        tags: [],
        id: 24
      });
      
      
      idx.add({
        title: "Κινητά και Κοινωνικά Μέσα",
        excerpt: "Βιβλιογραφία: ““Επικοινωνία ανθρώπου – υπολογιστή, 3ή Έκδοση”, Dix Alan J., Finlay Janet E., Abowd Gregory D., Beale Russell, Εκδόσεις Α....",
        categories: [],
        tags: [],
        id: 25
      });
      
      
      idx.add({
        title: "Αποθήκες Δεδομένων και Εξόρυξη Γνώσης",
        excerpt: "Βιβλιογραφία: “Εισαγωγή στην εξόρυξη δεδομένων, Tan Pang - Ning,Steinbach Michael,Kumar Vipin” eudoxus link “Εισαγωγή στην Εξόρυξη Δεδομένων και τις Αποθήκες...",
        categories: [],
        tags: [],
        id: 26
      });
      
      
      idx.add({
        title: "Δομές Δεδομένων",
        excerpt: "Βιβλιογραφία: “Δομές δεδομένων, αλγόριθμοι και εφαρμογές C++”, Sahnii Sartaj, Εκδόσεις ΤΖΙΟΛΑ, ISBN 978-960-418-030-1, 2004”eudoxus link “ΔΟΜΕΣ ΔΕΔΟΜΕΝΩΝ”, ΓΕΩΡΓΑΚΟΠΟΥΛΟΣ Γ.Φ., Εκδόσεις...",
        categories: [],
        tags: [],
        id: 27
      });
      
      
      idx.add({
        title: "Βάσεις Δεδομένων Ι",
        excerpt: "Βιβλιογραφία: ““Συστήματα Βάσεων Δεδομένων”, Silberschatz, Korth, Suda, Εκδόσεις Α. Γκιούρδα, ISBN 978-960-512-384-0, 2004” ““ΣΧΕΔΙΑΣΜΟΣ ΒΑΣΕΩΝ ΔΕΔΟΜΕΝΩΝ”, ΓΕΩΡΓΙΟΣ ΒΑΣΙΛΑΚΟΠΟΥΛΟΣ, Εκδόσεις Γ....",
        categories: [],
        tags: [],
        id: 28
      });
      
      
      idx.add({
        title: "Βάσεις Δεδομένων ΙΙ",
        excerpt: "Βιβλιογραφία: ““Θεμελιώδεις αρχές συστημάτων βάσεων δεδομένων”, Elmasri Ramez,Navathe Shamkant B, Εκδόσεις Δίαυλος, ISBN 978-960-531-220-6, 2008” ““Συστήματα Βάσεων Δεδομένων”, Ιωάννης Μανωλόπουλος...",
        categories: [],
        tags: [],
        id: 29
      });
      
      
      idx.add({
        title: "Ψηφιακή Επεξεργασία Εικόνας",
        excerpt: "Βιβλιογραφία: “ΨΗΦΙΑΚΗ ΕΠΕΞΕΡΓΑΣΙΑ ΕΙΚΟΝΑΣ”, ΙΩΑΝΝΗΣ ΠΗΤΑΣ, Εκδόσεις ΙΩΑΝΝΗΣ ΠΗΤΑΣ, 2010” “Ψηφιακή Επεξεργασία και Ανάλυση Εικόνας”, Παπαμάρκος Νικόλαος, Αυτοέκδοση, ISBN 978-960-92731-3-8,...",
        categories: [],
        tags: [],
        id: 30
      });
      
      
      idx.add({
        title: "Διακριτά Μαθηματικά",
        excerpt: "Βιβλιογραφία: “Διακριτά μαθηματικά”, Παναγιωτόπουλος Αντώνιος Χ., Εκδόσεις Σταμούλη, ISBN 960-351-227-3, 1999eudoxus link “ΣΤΟΙΧΕΙΑ ΔΙΑΚΡΙΤΩΝ ΜΑΘΗΜΑΤΙΚΩΝ”, LIU C.L., Εκδόσεις ΙΤΕ-ΠΑΝΕΠΙΣΤΗΜΙΑΚΕΣ ΕΚΔΟΣΕΙΣ...",
        categories: [],
        tags: [],
        id: 31
      });
      
      
      idx.add({
        title: "Κατανεμημένα Δικτυοκεντρικά Συστήματα",
        excerpt: "Βιβλιογραφία: ““ΚΑΤΑΝΕΜΗΜΕΝΑ ΣΥΣΤΗΜΑΤΑ: ΑΡΧΕΣ ΚΑΙ ΥΠΟΔΕΙΓΜΑΤΑ”, ANDREW S. TANENBAUM, MAARTEN VAN STEEN” eudoxus link ““ΚΑΤΑΝΕΜΗΜΕΝΑ ΣΥΣΤΗΜΑΤΑ ΜΕ JAVA”, Ι. Κ....",
        categories: [],
        tags: [],
        id: 32
      });
      
      
      idx.add({
        title: "Συστήματα Υποστήριξης Αποφάσεων",
        excerpt: "Βιβλιογραφία: “Συστήματα υποστήριξης αποφάσεων”, Ματσατσίνης Ν., Εκδόσεις Νέων Τεχνολογιών, 2010, ISBN 978-960-6759-44-4 eudoxus link “Διοικητική επιστήμη”, Πραστάκος Γρηγόρης Π., Εκδόσεις...",
        categories: [],
        tags: [],
        id: 33
      });
      
      
      idx.add({
        title: "Ηλεκτρονική Διακυβέρνηση",
        excerpt: "Βιβλιογραφία: “”Εισαγωγή στην ηλεκτρονική διακυβέρνηση” , Πομπόρτσης Ανδρέας, Εκδόσεις ΤΖΙΟΛΑ, ISBN 960-418-083-5, 2006” eudoxus link “”Ηλεκτρονική δημόσια διοίκηση” , Αποστολάκης...",
        categories: [],
        tags: [],
        id: 34
      });
      
      
      idx.add({
        title: "Ηλεκτρονικό Επιχειρείν",
        excerpt: "Βιβλιογραφία: “Ηλεκτρονικό εμπόριο 2008”, Turban E., King D., McKay J., Marshall P., Lee J., Viehland D., Volonino L., Cheung Ch.,...",
        categories: [],
        tags: [],
        id: 35
      });
      
      
      idx.add({
        title: "Τεχνολογία Ψυχαγωγικού Λογισμικού & Εικονικοί Κόσμοι",
        excerpt: "Βιβλιογραφία:\n\n  “ΒΙΝΤΕΟΠΑΙΧΝΙΔΙΑ: ΒΙΟΜΗΧΑΝΙΑ ΚΑΙ ΑΝΑΠΤΥΞΗ, ΚΩΣΤΑΣ ΑΝΑΓΝΩΣΤΟΥ”eudoxus link\n  “Εικονικά περιβάλλοντα πληροφόρησης, Κόκοτος Δημήτριος Χ.”eudoxus link\n\n",
        categories: [],
        tags: [],
        id: 36
      });
      
      
      idx.add({
        title: "Καινοτομία και Επιχειρηματικότητα",
        excerpt: "Βιβλιογραφία: “Η. Γ. Καραγιάννης, Ι. Λ. Μπακούρος, “Καινοτομία &amp; Επιχειρηματικότητα: Θεωρία – Πράξη”, Εκδόσεις Σοφία, 2010.” eudoxus link “Πιπερόπουλος Πάνος...",
        categories: [],
        tags: [],
        id: 37
      });
      
      
      idx.add({
        title: "Επικοινωνία Ανθρώπου-Υπολογιστή",
        excerpt: "Βιβλιογραφία: “Επικοινωνία ανθρώπου – υπολογιστή, 3ή Έκδοση, Dix Alan J., Finlay Janet E., Abowd Gregory D., Beale Russell, Εκδόσεις Α....",
        categories: [],
        tags: [],
        id: 38
      });
      
      
      idx.add({
        title: "Πληροφορική στις Ανθρωπιστικές Επιστήμες",
        excerpt: "Βιβλιογραφία: “ΤΕΧΝΟΛΟΓΙΕΣ ΠΛΗΡΟΦΟΡΙΩΝ ΚΑΙ ΕΠΙΚΟΙΝΩΝΙΑΣ &amp; ΚΟΙΝΩΝΙΑ, Ιωάννης Σ. Κουμπούρος”eudoxus link “Υπηρεσίες προστιθέμενης αξίας στο διαδίκτυο, Μήλιου Αμαλία Ν.,Πομπόρτσης Ανδρέας...",
        categories: [],
        tags: [],
        id: 39
      });
      
      
      idx.add({
        title: "Πολιτικές και Τεχνολογίες Ασφάλειας και Ιδιωτικότητας",
        excerpt: "Βιβλιογραφία: “Προστασία της Ιδιωτικότητας και Τεχνολογίες Πληροφορικής και Επικοινωνιών: Τεχνικά και Νομικά Θέματα, Λαμπρινουδάκης Κ., Μήτρου Λ., Γκρίτζαλης Σ. και...",
        categories: [],
        tags: [],
        id: 40
      });
      
      
      idx.add({
        title: "Ανάλυση και Σχεδιασμός Π.Σ.",
        excerpt: "Βιβλιογραφία: “Alan Dennis. Barbara Haley Wixom, David Tegarden (2010) Ανάλυση &amp; Σχεδιασμός Συστημάτων με τη UML 2.0: Μια αντικειμενοστρεφής Προσέγγιση,...",
        categories: [],
        tags: [],
        id: 41
      });
      
      
      idx.add({
        title: "Αναπαράσταση Πληροφοριών και Γνώσης",
        excerpt: "Βιβλιογραφία: “Εξόρυξη γνώσης από βάσεις δεδομένων και τον παγκόσμιο ιστό, Βαζιργιάννης Μιχάλης, Χαλκίδη Μαρία”eudoxus link “Εισαγωγή στην εξόρυξη δεδομένων, Tan...",
        categories: [],
        tags: [],
        id: 42
      });
      
      
      idx.add({
        title: "Ανάκτηση Πληροφορίας ",
        excerpt: "Βιβλιογραφία: “ΕΙΣΑΓΩΓΗ ΣΤΗΝ ΑΝΑΚΤΗΣΗ ΠΛΗΡΟΦΟΡΙΩΝ”, CHRISTOPHER D. MANNING, PRABHAKAR RAGHAVAN, HINRICH eudoxus link “Ανάκτηση Πληροφορίας”, 2η Έκδοση, Baeza-Yates Ricardo, Ribeiro-Neto...",
        categories: [],
        tags: [],
        id: 43
      });
      
      
      idx.add({
        title: "Πληροφοριακά Συστήματα και Εφοδιαστική Αλυσίδα",
        excerpt: "Βιβλιογραφία: -“Πληροφοριακά Συστήματα Διαχείρισης Επιχειρησιακών Πόρων:Στρατηγικές &amp; Εφαρμογές, Γιάννης Πολλάλης, Αθανάσιος Βοζίκης”eudoxus link -“ΣΥΓΧΡΟΝΑ ΕΠΙΧΕΙΡΗΣΙΑΚΑ ΣΥΣΤΗΜΑΤΑ, ΚΩΝΣΤΑΝΤΙΝΟΣ Ι. ΣΤΕΦΑΝΟΥ, ΧΡΗΣΤΟΣ...",
        categories: [],
        tags: [],
        id: 44
      });
      
      
      idx.add({
        title: "Διοίκηση Ασφάλειας Πληροφοριακών Συστημάτων",
        excerpt: "Βιβλιογραφία:\n\n  “Διαχείριση Ασφάλειας Πληροφοριών, Σωκράτης Κάτσικας”eudoxus link\n  “Ασφάλεια Πληροφοριακών Συστημάτων, Σωκτ. Κάτσικας - Δ. Γκρίτζαλης - Στεφ. Γκρίτζαλης”eudoxus link\n\n\n",
        categories: [],
        tags: [],
        id: 45
      });
      
      
      idx.add({
        title: "Θεωρία της Πληροφορίας",
        excerpt: "Βιβλιογραφία: ““Εισαγωγή στη θεωρία της πληροφορίας”, Αφράτη Φώτω, Εκδόσεις Συμμετρία, 1994”[eudoxus link}(https://service.eudoxus.gr/search/#a/id:45421/0) ““Εισαγωγή στη θεωρία Πληροφοριών, Κωδίκων και Κρυπτογραφίας”, Ν....",
        categories: [],
        tags: [],
        id: 46
      });
      
      
      idx.add({
        title: "Τεχνολογίες Διαδικτύου",
        excerpt: "Βιβλιογραφία: “Ανάπτυξη Web Εφαρμογών με PHP και MySQL”, Welling Luke,Thomson Laura, Εκδόσεις Α. Γκιούρδα, ISBN 960-512-357-6, 2005”eudoxus link “ΑΡΧΙΤΕΚΤΟΝΙΚΗ ΠΛΑΤΦΟΡΜΑΣ...",
        categories: [],
        tags: [],
        id: 47
      });
      
      
      idx.add({
        title: "Εισαγωγή στην Επιστήμη των Υπολογιστών",
        excerpt: "Βιβλιογραφία: “Εισαγωγή στη σύγχρονη επιστήμη των υπολογιστών, Lister Andrew M., Εκδόσεις Δίαυλος, ISBN 978-960-7140-65-4, 2000” “Εισαγωγή στην επιστήμη των Υπολογιστών,...",
        categories: [],
        tags: [],
        id: 48
      });
      
      
      idx.add({
        title: "Εισαγωγή στον Προγραμματισμό",
        excerpt: "Βιβλιογραφία: “C Προγραμματισμός”, 7η Έκδοση, Paul Deitel, Harvey Deitel, Εκδόσεις Χ. ΓΚΙΟΥΡΔΑ &amp; ΣΙΑ ΕΕ, ISBN 978-960-512-6414, 2014” eudoxus link...",
        categories: [],
        tags: [],
        id: 49
      });
      
      
      idx.add({
        title: " Γλωσσική Τεχνολογία",
        excerpt: "Βιβλιογραφία: ““Η μηχανική μετάφραση και η ελληνική γλώσσα”, Σταύρου Μ., Τζεβελέκου Μ., Ινστιτούτο Επεξεργασίας του Λόγου, Εκδόσεις Καστανιώτη, ISBN 960-03-2718-1,...",
        categories: [],
        tags: [],
        id: 50
      });
      
      
      idx.add({
        title: "Γραμμική Άλγεβρα",
        excerpt: "Βιβλιογραφία: “Μια Εισαγωγή στη Γραμμική Άλγεβρα Τόμος Ι, ΒΑΡΣΟΣ, ΔΕΡΙΖΙΩΤΗΣ, ΕΜΜΑΝΟΥΗΛ, ΜΑΛΙΑΚΑΣ, ΜΕΛΑΣ, ΤΑΛΕΛΛΗ, Εκδόσεις ΣΟΦΙΑ, 2008” “ΕΙΣΑΓΩΓΗ ΣΤΗΝ ΓΡΑΜΜΙΚΗ...",
        categories: [],
        tags: [],
        id: 51
      });
      
      
      idx.add({
        title: "Λογικός Προγραμματισμός",
        excerpt: "Βιβλιογραφία: “Μητακίδης Γιώργος, “Από τη λογική στο λογικό προγραμματισμό και την Prolog”, Εκδόσεις ΚΑΡΔΑΜΙΤΣΑ, 1992.” eudoxus link “ΝΟΤΟΠΟΥΛΟΣ ΠΑΝΑΓΙΩΤΗΣ, “ΠΡΟΓΡΑΜΜΑΤΙΖΟΝΤΑΣ...",
        categories: [],
        tags: [],
        id: 52
      });
      
      
      idx.add({
        title: "Διαχείριση Έργων Πληροφορικής",
        excerpt: "Βιβλιογραφία:\n\n  “Διαχείριση έργων πληροφορικής, Κιουντούζης Ευάγγελος Α.”eudoxus link\n  “Διαχείριση έργου - project management, Burke Rory”eudoxus link\n\n\n",
        categories: [],
        tags: [],
        id: 53
      });
      
      
      idx.add({
        title: "Μαθηματικός Προγραμματισμός",
        excerpt: "Βιβλιογραφία:\n\n  “Γραμμικός Προγραμματισμός», Γ. Σίσκος, 2000, ΕΚΔΟΣΕΙΣ ΝΕΩΝ ΤΕΧΝΟΛΟΓΙΩΝ”eudoxus link\n  “Γραμμικός Προγραμματισμός», Δημήτρης Δεσπότης, 2011, ΕΚΔΟΣΕΙΣ ΔΕΣΠΟΤΗΣ ΔΗΜΗΤΡΙΟΣ”eudoxus link\n\n",
        categories: [],
        tags: [],
        id: 54
      });
      
      
      idx.add({
        title: "Εισαγωγή στα Πληροφοριακά Συστήματα",
        excerpt: "Βιβλιογραφία: “Κιουντούζης, Ε. (2009) ”Μεθοδολογίες Ανάλυσης και Σχεδιασμού Πληροφοριακών Συστημάτων” , Εκδόσεις Μπένου (3η Έκδοση), Αθήνα.” eudoxus link “Avison, D.,...",
        categories: [],
        tags: [],
        id: 55
      });
      
      
      idx.add({
        title: "Πολυμέσα",
        excerpt: "Βιβλιογραφία: Τεχνολογία πολυμέσων, Δημητριάδης Σταύρος Ν., Πομπόρτσης Ανδρέας Σ., Τριανταφύλλου Ευάγγελος Γ., Εκδόσεις ΤΖΙΟΛΑ, ISBN 978-960-418-025-7, 2004 Πολυμέσα Θεωρία και...",
        categories: [],
        tags: [],
        id: 56
      });
      
      
      idx.add({
        title: "Δίκτυα I",
        excerpt: "Βιβλιογραφία: ““Δίκτυα Επικοινωνιών, ένα πρώτο μάθημα”, Jean Walrand, Μετάφραση-Επιμέλεια: Ιωάννης Σταυρακάκης, Λάζαρος Μεράκος, Εκδόσεις ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΚΟΝΔΥΛΙΩΝ ΕΡΕΥΝΑΣ – ΕΚΠΑ,...",
        categories: [],
        tags: [],
        id: 57
      });
      
      
      idx.add({
        title: "Δίκτυα II",
        excerpt: "Βιβλιογραφία: ““ΔΙΚΤΥΑ ΥΠΟΛΟΓΙΣΤΩΝ: ΜΙΑ ΠΡΟΣΕΓΓΙΣΗ ΑΠΟ ΤΗ ΣΚΟΠΙΑ ΤΩΝ ΣΥΣΤΗΜΑΤΩΝ”, LARRY L. PETERSON, BRUCE S. DAVIE, Εκδόσεις Κλειδάριθμος, ISBN 978-960-461-266-6,...",
        categories: [],
        tags: [],
        id: 58
      });
      
      
      idx.add({
        title: "Αντικειμενοστρεφής Προγραμματισμός",
        excerpt: "Βιβλιογραφία: ““Java προγραμματισμός”, 10η Έκδοση, Paul Deitel, Harvey Deitel, Εκδόσεις Χ. ΓΚΙΟΥΡΔΑ ΣΙΑ ΕΕ, ISBN 978-960-512-6810, 2015”eudoxus link ““Java Eισαγωγή...",
        categories: [],
        tags: [],
        id: 59
      });
      
      
      idx.add({
        title: "Λειτουργικά Συστήματα",
        excerpt: "Βιβλιογραφία: ““Λειτουργικά Συστήματα Αρχές Σχεδίασης”, William Stallings, 8η Έκδοση, Εκδόσεις Τζιόλα”eudoxus link ““ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΣΕ UNIX”,MARC J. ROCHKIND, ΕΚΔΟΣΕΙΣ ΚΛΕΙΔΑΡΙΘΜΟΣ”eudoxus link...",
        categories: [],
        tags: [],
        id: 60
      });
      
      
      idx.add({
        title: "Παράλληλος Προγραμματισμός",
        excerpt: "Βιβλιογραφία: “Peter S. Pacheco, ”Εισαγωγή στον Παράλληλο Προγραμματισμό” , ΚΛΕΙΔΑΡΙΘΜΟΣ, 2015.” [eudoxus link] (https://service.eudoxus.gr/search/#a/id:50656351/0) “Γραμματή Πάντζιου, Βασίλειος Μάμαλης, Αλέξανδρος Τομαράς...",
        categories: [],
        tags: [],
        id: 61
      });
      
      
      idx.add({
        title: "Αναγνώριση Προτύπων",
        excerpt: "Βιβλιογραφία: ““Αναγνώριση προτύπων”, ΣΤΡΙΝΤΖΗΣ Μ., Εκδόσεις Αδελφοί Κυριακίδη, ISBN 978-960-343-290-6, 2007” [eudoxus link] (https://service.eudoxus.gr/search/#a/id:6378/0) ““Ευφυής έλεγχος”, Κινγκ Ρ., Εκδόσεις ΤΖΙΟΛΑ,...",
        categories: [],
        tags: [],
        id: 62
      });
      
      
      idx.add({
        title: "Μοντέλα Κβαντικού και Μοριακού Υπολογισμού",
        excerpt: "Βιβλιογραφία: “ΚΒΑΝΤΙΚΟΙ ΥΠΟΛΟΓΙΣΤΕΣ: ΒΑΣΙΚΕΣ ΕΝΝΟΙΕΣ”, Ιωάννης Καραφυλλίδης, Εκδόσεις ΚΛΕΙΔΑΡΙΘΜΟΣ, ISBN 978-960-209-816-5, 2005.” “Το νέο κβαντικό σύμπαν”, T.HEY, P.WALTERS, Εκδόσεις ΑΛ....",
        categories: [],
        tags: [],
        id: 63
      });
      
      
      idx.add({
        title: "Ασφάλεια υπολογιστών και προστασία δεδομένων",
        excerpt: "Βιβλιογραφία: “”Ασφάλεια Πληροφοριακών Συστημάτων” Κ. Κάτσικας, Δ. Γκρίτζαλης, Σ. Γκρίτζαλης. Νέων Τεχνολογιών, 2004.” eudoxus link “”Βασικές Αρχές Ασφάλειας Δικτύων” W....",
        categories: [],
        tags: [],
        id: 64
      });
      
      
      idx.add({
        title: "Σημασιολογικός και Κοινωνικός Ιστός",
        excerpt: "Βιβλιογραφία: “ΕΙΣΑΓΩΓΗ ΣΤΟ ΣΗΜΑΣΙΟΛΟΓΙΚΟ ΙΣΤΟ, GRIGORIS ANTONIOU, FRANK VAN HARMELEN”eudoxus link “Εξόρυξη γνώσης από βάσεις δεδομένων και τον παγκόσμιο ιστό,...",
        categories: [],
        tags: [],
        id: 65
      });
      
      
      idx.add({
        title: "Προσομοίωση και Μοντελοποίηση",
        excerpt: "Βιβλιογραφία: ““Προσομοίωση διακριτών συστημάτων”, Khoshnevis Behrokh, Εκδόσεις Δίαυλος, ISBN 978-960-531-031-8, 1999” eudoxus link ““Προσομοίωση δικτύων υπολογιστών”, Πομπόρτσης Ανδρέας Σ., Τσουλφάς...",
        categories: [],
        tags: [],
        id: 66
      });
      
      
      idx.add({
        title: "Κοινωνικά και Νομικά Θέματα των ΤΠΕ",
        excerpt: "Βιβλιογραφία:\n\n  “Το δίκαιο του διαδικτύου (internet), Σιδηρόπουλος Θεόδωρος”eudoxus link\n  “Το δίκαιο του ηλεκτρονικού εμπορίου, Αλεξανδρίδου Ελίζα Δ.”eudoxus link\n\n\n",
        categories: [],
        tags: [],
        id: 67
      });
      
      
      idx.add({
        title: "Τεχνολογία Λογισμικού",
        excerpt: "Βιβλιογραφία: ““Ο ΠΡΑΚΤΙΚΟΣ ΠΡΟΓΡΑΜΜΑΤΙΣΤΗΣ”, ANDREW HUNT, DAVID THOMAS, Εκδόσεις Κλειδάριθμος, ISBN 978-960-461-135-5, 2008”eudoxus link ““ΑΝΑΓΝΩΣΗ ΚΩΔΙΚΑ”, ΔΙΟΜΗΔΗΣ ΣΠΙΝΕΛΛΗΣ, Εκδόσεις Κλειδάριθμος,...",
        categories: [],
        tags: [],
        id: 68
      });
      
      
      idx.add({
        title: "Ειδικά Θέματα Ασφάλειας Πληροφοριών",
        excerpt: "Βιβλιογραφία: ” ΒΑΣΙΚΕΣ ΑΡΧΕΣ ΑΣΦΑΛΕΙΑΣ ΔΙΚΤΥΩΝ: ΕΦΑΡΜΟΓΕΣ ΚΑΙ ΠΡΟΤΥΠΑ”, WILLIAM STALLINGS eudoxos link ” Ασφάλεια Πληροφοριακών Συστημάτων”, Σωκτ. Κάτσικας -...",
        categories: [],
        tags: [],
        id: 69
      });
      
      
      idx.add({
        title: "Επεξεργασία Ομιλίας και Ήχου",
        excerpt: "Βιβλιογραφία:\n\n  “Ψηφιακή επεξεργασία σήματος, Antoniou A.”eudoxus link\n  “Ψηφιακή Επεξεργασία Φωνής: Θεωρία και Εφαρμογές, Rabiner L.”eudoxus link\n\n\n",
        categories: [],
        tags: [],
        id: 70
      });
      
      
      idx.add({
        title: "Στατιστική ",
        excerpt: "Βιβλιογραφία: “Περιγραφική και διερευνητική στατιστική ανάλυση δεδομένων”, Γεωργιακώδης Φώτης A.,Τσίμπος Κλέων Χ., Εκδόσεις Σταμούλη, ISBN 978-960-351-315-6, 2000”eudoxus link “Πιθανότητες, τυχαίες...",
        categories: [],
        tags: [],
        id: 71
      });
      
      
      idx.add({
        title: "Στρατηγική και Διοίκηση Πληροφοριακών Συστημάτων",
        excerpt: "Βιβλιογραφία: “ΠΛΗΡΟΦΟΡΙΑΚΑ ΣΥΣΤΗΜΑΤΑ ΔΙΟΙΚΗΣΗΣ, KENNETH C. LAUDON, JANE P. LAUDON”eudoxus link “ΚΑΙΝΟΤΟΜΙΑ, ΣΤΡΑΤΗΓΙΚΗ, ΑΝΑΠΤΥΞΗ ΚΑ ΠΛΗΡΟΦΟΡΙΑΚΑ ΣΥΣΤΗΜΑΤΑ, Γεώργιος Δουκίδης”eudoxus link...",
        categories: [],
        tags: [],
        id: 72
      });
      
      
      idx.add({
        title: "Πιθανότητες",
        excerpt: "Βιβλιογραφία: “ΕΙΣΑΓΩΓΗ ΣΤΗ ΘΕΩΡΙΑ ΠΙΘΑΝΟΤΗΤΩΝ”, HOEL P., PORT S., STONE C., Εκδόσεις ΙΤΕ-ΠΑΝΕΠΙΣΤΗΜΙΑΚΕΣ ΕΚΔΟΣΕΙΣ ΚΡΗΤΗΣ, ISBN 978-960-524-156-8, 2009”eudoxus link “Πιθανότητες,...",
        categories: [],
        tags: [],
        id: 73
      });
      
      
  

  

  

  
    
    
      idx.add({
        title: "Θεόδωρος Ανδρόνικος",
        excerpt: "education: “Δίπλωμα Ηλεκτρολόγου Μηχανικού και Μηχανικού Υπολογιστών με κατεύθυνση Πληροφορικής από τη Σχολή Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών του Εθνικού...",
        categories: [],
        tags: ["Διαδικτυακός προγραμματισμός","Δυναμικοί αλγόριθμοι για παράλληλα & κατανεμημένα ετερογενή συστήματα","Αλγόριθμοι ερωταποκρίσεων για διαδικτυακά δεδομένα (XML, XPath)","Χρονικές (Temporal) λογικές για αυτόματη επαλήθευση και σύνθεση συστημάτων"],
        id: 74
      });
      
      
      idx.add({
        title: "Αγγελική Τσώχου",
        excerpt: "education: “Πτυχίο Πληροφορικής, Τμήμα Πληροφορικής, Οικονομικό Πανεπιστήμιο Αθηνών” “Μεταπτυχιακό Δίπλωμα Ειδίκευσης, MSc: «Πληροφοριακά Συστήματα», Τμήμα Πληροφορικής, Οικονομικό Πανεπιστήμιο Αθηνών” “Διδακτορικό...",
        categories: [],
        tags: ["Πολιτικές Ασφάλειας, Αντιλήψεις Επικινδυνότητας και Ενημερότητα Χρηστών","Ανάλυση Επικινδυνότητας και Διοίκηση Ασφάλειας Πληροφοριών","Πολιτικές Ασφάλειας για την Ορθή Χρήση του Διαδικτύου","Ιδιωτικότητα και Εργαλεία Ενίσχυσης της Ιδιωτικότητας","Ιδιωτικότητα σε Δικτυακές Εφαρμογές Κινητών Συσκευών","Πρότυπα Ασφάλειας και Ιδιωτικότητας","Ηλεκτρονικές Υπηρεσίες, Ηλεκτρονική Διακυβέρνηση και Πληροφοριακά Συστήματα"],
        id: 75
      });
      
      
      idx.add({
        title: "Μάρκος Αυλωνίτης",
        excerpt: "education:\n\n  “Πτυχίο Φυσικής, Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης, Σχολή Θετικών Επιστημών”\n  “Διδακτορικό Δίπλωμα στη Μηχανική, Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης, Πολυτεχνική Σχολή”\n\n\n",
        categories: [],
        tags: ["Εφαρμοσμένες στοχαστικές διεργασίες (επιστήμη υπολογιστών, μηχανική, περιβάλλον)","Συστήματα αυτοοργάνωσης","Εξάπλωση κακόβουλου λογισμικού","Μοντελοποίηση και προσομοίωση δικτύων μεγάλης κλίμακας"],
        id: 76
      });
      
      
      idx.add({
        title: "Κωνσταντίνος Χωριανόπουλος",
        excerpt: "education: “Δίπλωμα Ηλεκτρονικών Μηχανικών και Μηχανικών Υπολογιστών, Πολυτεχνείο Κρήτης” “Μεταπτυχιακό Μάρκετινγκ και Επικοινωνία με Νέες Τεχνολογίες, Τμήμα Μάρκετινγκ και Επικοινωνίας,...",
        categories: [],
        tags: ["Κοινωνικά και Συνεργατικά Συστήματα"],
        id: 77
      });
      
      
      idx.add({
        title: "Χρήστος Αναγνωστόπουλος",
        excerpt: "education: “Πτυχίο Τμήματος Πληροφορικής και Τηλεπικοινωνιών, Εθνικό και Καποδιστριακό Πανεπιστήμιο Αθηνών” “Μεταπτυχιακό Δίπλωμα Ειδίκευσης “Προηγμένα Πληροφοριακά Συστήματα”, Τμήμα Πληροφορικής και...",
        categories: [],
        tags: ["Κινητός και Κατανεμημένος Υπολογισμός (Mobile and Distributed Computing)","Συστήματα Επίγνωσης Πληροφορίας και Διάχυτος Υπολογισμός (Context-aware and Pervasive Computing)","Ασύρματα Δίκτυα Αισθητήρων (Wireless Sensor Networks)","Δικτυοκεντρικά Πληροφοριακά Συστήματα (Network-centric Information Systems)"],
        id: 78
      });
      
      
      idx.add({
        title: "Δημήτριος Τσουμάκος",
        excerpt: "education: “Πτυχίο Ηλεκτρολόγου Μηχανικού και Μηχανικού Η/Υ, Τμήμα Ηλεκτρολόγων Μηχ. και Μηχ. Υπολογιστών, Εθνικό Μετσόβιο Πολυτεχνείο. Τίτλος Διπλωματικής Εργασίας: ‘Ηλεκτρονικός...",
        categories: [],
        tags: ["Κατανεμημένη διαχείριση δεδομένων","Υπολογιστικά νέφη και διαχείριση δεδομένων","Βάσεις δεδομένων και αποθήκες δεδομένων στο διαδίκτυο"],
        id: 79
      });
      
      
      idx.add({
        title: "Εμμανουήλ Μάγκος",
        excerpt: "education:\n\n  “Πτυχίο Πληροφορικής, Πανεπιστήμιο Πειραιώς”\n  “Διδακτορικό Δίπλωμα σε “Ασφαλή Ηλεκτρονικά Συστήματα Συναλλαγών μέσω Internet”, Πανεπιστήμιο Πειραιώς”\n\n\n",
        categories: [],
        tags: ["Κρυπτογραφικές Τεχνικές στην Ασφάλεια Υπολογιστών και Δικτύων","Ασφάλεια και Ιδιωτικότητα στο Διαδίκτυο","Ασφάλεια και Ιδιωτικότητα σε Κατανεμημένες Εφαρμογές"],
        id: 80
      });
      
      
      idx.add({
        title: "Φοίβος Μυλωνάς",
        excerpt: "education: “Δίπλωμα Ηλεκτρολόγου Μηχανικού και Μηχανικού Ηλεκτρονικών Υπολογιστών, Σχολή Ηλεκτρολόγων Μηχανικών και Μηχανικών Ηλεκτρονικών Υπολογιστών, Ε.Μ.Π., 2001” “Μεταπτυχιακό Δίπλωμα Ειδίκευσης...",
        categories: [],
        tags: ["Υποβοηθούμενη από γνώση Ανάλυση Πολυμεσικού Περιεχομένου","Ανάκτηση Πολυμεσικής Πληροφορίας","Προσωποποίηση Πολυμεσικού Περιεχομένου","Προσαρμογή Πολυμεσικού Περιεχομένου στο χρήστη","Μοντελοποίηση χρηστών","Εξαγωγή προφίλ χρηστών","Αναπαράσταση και Ανάλυση οπτικού εννοιολογικού πλαισίου (visual context)","Αλληλεπίδραση ανθρώπου-υπολογιστή"],
        id: 81
      });
      
      
      idx.add({
        title: "Κάτια Λήδα Κερμανίδου",
        excerpt: "education: “Δίπλωμα Ηλεκτρολόγων Μηχανικών και Τεχνολογίας Υπολογιστών, Πανεπιστήμιο Πατρών” “Διδακτορικό Δίπλωμα με τίτλο διατριβής «Αυτόματη Μάθηση Συντακτικών Εξαρτήσεων και Ανάπτυξη...",
        categories: [],
        tags: ["Μηχανική Μάθηση","Επεξεργασία Φυσικής Γλώσσας","Μοντελοποίηση Χρήστη","Εφαρμογές Πληροφορικής στις Ανθρωπιστικές και Κοινωνικές Επιστήμες"],
        id: 82
      });
      
      
      idx.add({
        title: "Μιχαήλ Στεφανιδάκης",
        excerpt: "education: “Δίπλωμα Μηχανικού Ηλεκτρονικών Υπολογιστών και Πληροφορικής, Πανεπιστήμιο Πατρών” “Διδακτορικό Δίπλωμα με θέμα τη “Σχεδίαση και Μελέτη Απόδοσης Παράλληλης Αρχιτεκτονικής...",
        categories: [],
        tags: ["Κατανεμημένες αρχιτεκτονικές υπολογιστικών συστημάτων υψηλών επιδόσεων -Ενσωματωμένα συστήματα πραγματικού χρόνου","Αρχιτεκτονικές συστημάτων αυξημένης υπολογιστικής παρουσίας  (pervasive computing systems)"],
        id: 83
      });
      
      
      idx.add({
        title: "Κωνσταντίνος Οικονόμου",
        excerpt: "education: “Δίπλωμα Μηχανικού Ηλεκτρονικών Υπολογιστών και Πληροφορικής, Πανεπιστήμιο Πατρών” “Μεταπτυχιακό Δίπλωμα Ειδίκευσης, MSc in Communication and Signal Processing from the...",
        categories: [],
        tags: ["Αυτόνομα Δίκτυα","Ανάλυση Απόδοσης Δικτύων","Πρόσβαση Μέσου"],
        id: 84
      });
      
      
      idx.add({
        title: "Αδαμαντία Πατέλη",
        excerpt: "education: “Πτυχίο Πληροφορικής, Οικονομικό Πανεπιστήμιο Αθηνών” “ΜSc in Electronic Commerce, University of Manchester Institute of Science &amp; Technology” “Διδακτορικό Δίπλωμα...",
        categories: [],
        tags: ["Διοίκηση Πληροφοριακών Συστημάτων","Επιχειρηματικά Μοντέλα","Ψηφιακή Επιχειρηματικότητα","Ανοικτή Καινοτομία","Crowdsourcing"],
        id: 85
      });
      
      
      idx.add({
        title: "Παναγιώτης Κουρουθανάσης",
        excerpt: "education: “Πτυχίο Πληροφορικής, Οικονομικό Πανεπιστήμιο Αθηνών” “Μεταπτυχιακό δίπλωμα ειδίκευσης στις Επιστήμες των Αποφάσεων, Οικονομικό Πανεπιστήμιο Αθηνών” “Διδακτορικό δίπλωμα στα Πληροφοριακά...",
        categories: [],
        tags: ["Ηλεκτρονικό Επιχειρείν","Ηλεκτρονική Διακυβέρνηση","Πληροφοριακά Συστήματα"],
        id: 86
      });
      
      
      idx.add({
        title: "Σπύρος Σιούτας",
        excerpt: "education: “Δίπλωμα Μηχανικού Η/Υ &amp; Πληροφορικής, Πανεπιστήμιο Πατρών” “Μεταπτυχιακό Δίπλωμα Ειδίκευσης, MSc: «Τεχνικές εξάλειψης κατανεμημένης πολυπλοκότητας και εφαρμογή τους στη...",
        categories: [],
        tags: ["Δομές Δεδομένων και Αλγόριθμοι","Υπολογιστική Γεωμετρία και Χωρικές Βάσεις Δεδομένων","Χώρο-Χρονικές και Πολυμεσικές Βάσεις Δεδομένων","Κατανεμημένες Δομές Δεδομένων και P2P Συστήματα","Διαχείριση Μεγάλου Όγκου Δεδομένων σε Συστήματα Υπολογιστικού Νέφους (Cloud)","Αποθήκες Δεδομένων και Αλγόριθμοι Εξόρυξης Γνώσης","Χωρικές Δομές Δεδομένων και GIS"],
        id: 87
      });
      
      
      idx.add({
        title: "Βασίλειος Χρυσικόπουλος",
        excerpt: "education: “Δίπλωμα Φυσικομαθηματικής Σχολής Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης” “MSc στην Επιχειρησιακή Έρευνα, Chelsea College, London University” “PhD Royal Holloway, London University”...",
        categories: [],
        tags: ["Ασφάλεια","Δίκτυα Η/Υ"],
        id: 88
      });
      
      
      idx.add({
        title: "Παναγιώτης Βλάμος ",
        excerpt: "education:\n\n  “Πτυχίο Μαθηματικών, Πανεπιστήμιο Αθηνών”\n  “Διδακτορικό Δίπλωμα στα Μαθηματικά, Τμήμα Εφαρμοσμένων Μαθηματικών και Φυσικών Επιστημών, Ε.Μ. Πολυτεχνείου.”\n\n\n",
        categories: [],
        tags: ["Μαθηματικά μοντέλα με εφαρμογές σε προβλήματα τεχνικών αποκατάστασης εικόνας φυσικών επιστημών και χημικής μηχανικής","Μαθηματικά μοντέλα στην εκπαίδευση με χρήση νέων τεχνολογιών"],
        id: 89
      });
      
      
  

  

  
    
    
      idx.add({
        title: "Εργαστηριακό Προσωπικό",
        excerpt: "\n",
        categories: [],
        tags: [],
        id: 90
      });
      
      
      idx.add({
        title: "Προπτυχιακά Μαθήματα",
        excerpt: "Για το ακαδημαϊκό έτος 2015 – 2016 εισήχθησαν στο Τμήμα Πληροφορικής 200 φοιτητές/τριες με το σύστημα των Πανελληνίων Εξετάσεων από...",
        categories: [],
        tags: [],
        id: 91
      });
      
      
      idx.add({
        title: "Προσωπικό",
        excerpt: "ΔΙΔΑΚΤΙΚΟ Καθηγητές Αναπληρωτές Καθηγητές Επίκουροι Καθηγητές Καθηγητές Βασίλειος Χρυσικόπουλος Πληροφορική – Δίκτυα – Ασφάλεια Πληροφοριών Παναγιώτης Βλάμος Μαθηματικά με έμφαση...",
        categories: [],
        tags: [],
        id: 92
      });
      
      
      idx.add({
        title: "Εργαστήρια",
        excerpt: "Εργαστήριο Βιοπληροφορικής και Ανθρώπινης Ηλεκτροφυσιολογίας (BIHELab) Το εργαστήριο Βιοπληροφορικής και Ανθρώπινης Ηλεκτροφυσιολογίας καλύπτει τις ερευνητικές δραστηριότητες του Τμήματος Πληροφορικής του...",
        categories: [],
        tags: [],
        id: 93
      });
      
      
      idx.add({
        title: "Τμήμα Πληροφορικής",
        excerpt: "Ανακοινώσεις Ενημερωθείτε για τα τελευταία νέα του τμήματος Πληροφορικής. Learn More Ερευνητικά Προγράμματα Δείτε όλα τα ερευνητικά προγράμματα του τμήματος...",
        categories: [],
        tags: [],
        id: 94
      });
      
      
      idx.add({
        title: "Ανθρωπιστικές Επιστήμες",
        excerpt: "Γραφικά με Υπολογιστές Βασικές έννοιες γραφικών με υπολογιστές και εφαρμογές τους, Ιστορία και γενικά χαρακτηριστικά, Διανυσματική(ά) / Πλεγματική(ά) απεικόνιση/γραφικά, Εισαγωγικά......",
        categories: [],
        tags: [],
        id: 95
      });
      
      
      idx.add({
        title: "Index",
        excerpt: "",
        categories: [],
        tags: [],
        id: 96
      });
      
      
      idx.add({
        title: "Μαθήματα Μεταπτυχιακού",
        excerpt: "ΜΑΘΗΜΑΤΑ A Εξάμηνο Β Εξάμηνο A Εξάμηνο Διοικητική Πληροφοριακών Συστημάτων Α. Αξιοποίηση της πληροφορικής από τους οργανισμούς: Σημασία της πληροφορικής...",
        categories: [],
        tags: [],
        id: 97
      });
      
      
      idx.add({
        title: "Pages",
        excerpt: "&lt;h2 id=\"administrative-assistants\" class=\"archive__subtitle\"&gt;&lt;/h2&gt; &lt;h2 id=\"administrative-assistants-en\" class=\"archive__subtitle\"&gt;&lt;/h2&gt; &lt;h2 id=\"courses\" class=\"archive__subtitle\"&gt;&lt;/h2&gt; Τεχνητή Νοημοσύνη Στόχοι της Τεχνητής Νοημοσύνης. Ιστορική Αναδρομή. Προβλήματα και επίλυση....",
        categories: [],
        tags: [],
        id: 98
      });
      
      
      idx.add({
        title: "Ανακοινώσεις",
        excerpt: "2016 2ο Παγκόσμιο Συνέδριο GeNeDis 2016 Το 2ο Παγκόσμιο Συνέδριο για την Γενετική, Γηριατρική και την Έρευνα νευροεκφυλιστικών νόσων, το...",
        categories: [],
        tags: [],
        id: 99
      });
      
      
      idx.add({
        title: "Προγράμματα",
        excerpt: "Cultural Understanding through Learning and Technology (CULT) Το έργο CULT εστιάζει πάνω στην μελέτη των κοινωνικών επιδράσεων του συστήματος σε...",
        categories: [],
        tags: [],
        id: 100
      });
      
      
      idx.add({
        title: "Αναζήτηση στην ιστοσελίδα",
        excerpt: "\n",
        categories: [],
        tags: [],
        id: 101
      });
      
      
      idx.add({
        title: "Πληροφοριακών Συστημάτων",
        excerpt: "Συστήματα Υποστήριξης Αποφάσεων Εισαγωγή στη θεωρία Αποφάσεων, Η φιλοσοφία των Συστημάτων Υποστήριξης Αποφάσεων και ο ρόλος τους στις διαδικασίες λήψης...",
        categories: [],
        tags: [],
        id: 102
      });
      
      
      idx.add({
        title: "Ερευνητικά Ενδιαφέροντα του Τμήματος",
        excerpt: "XPath) Αντιλήψεις Επικινδυνότητας και Ενημερότητα Χρηστών Ηλεκτρονική Διακυβέρνηση και Πληροφοριακά Συστήματα μηχανική περιβάλλον) Crowdsourcing Αδαμαντία Πατέλη Διοίκηση Πληροφοριακών Συστημάτων και...",
        categories: [],
        tags: [],
        id: 103
      });
      
      
  

  
    
    
      idx.add({
        title: "Εργαστήριο Βιοπληροφορικής και Ανθρώπινης Ηλεκτροφυσιολογίας (BIHELab)",
        excerpt: "Οι νευροεκφυλιστικές παθήσεις, προσβάλλουν πλέον ένα σημαντικό ποσοστό του πληθυσμού των σύγχρονων δυτικών κοινωνιών. Τα τελευταία χρόνια καταβάλλεται μια συστηματική...",
        categories: [],
        tags: [],
        id: 104
      });
      
      
      idx.add({
        title: "Εργαστήριο Υπολογιστικής Μοντελοποίησης (CMODLab)",
        excerpt: "Οι ερευνητικές δραστηριότητες που υποστηρίζονται από το Εργαστήριο Υπολογιστικής Μοντελοποίησης αφορούν ένα ευρύτατο φάσμα της επιστήμης της Πληροφορικής με έμφαση...",
        categories: [],
        tags: [],
        id: 105
      });
      
      
      idx.add({
        title: "Εργαστήριο Εφαρμογών Πληροφορικής στις Ανθρωπιστικές – Κοινωνικές Επιστήμες (HILab)",
        excerpt: "Αφ’ ετέρου χρησιμοποιεί μεθοδολογίες των επιστημών αυτών για να προσδώσει στις υπηρεσίες και τα προϊόντα των νέων τεχνολογιών βέλτιστη ποιότητα...",
        categories: [],
        tags: [],
        id: 106
      });
      
      
      idx.add({
        title: "Εργαστήριο Πληροφορικών Συστημάτων και Βάσεων Δεδομένων (ISDLab)",
        excerpt: "Οι επιστημονικές περιοχές που το εργαστήριο κυρίως καλύπτει αφορούν στις ακόλουθες: ανάλυση και σχεδιασμό πληροφοριακών συστημάτων, αξιολόγηση καινοτόμων εφαρμογών πληροφορικής,...",
        categories: [],
        tags: [],
        id: 107
      });
      
      
      idx.add({
        title: "Εργαστήριο Δικτύων, Πολυμέσων και Ασφάλειας Συστημάτων (NMSLab)",
        excerpt: "Ο εκπαιδευτικός ρόλος του NMSLab είναι να υποστηρίζει τα μαθήματα του προπτυχιακού προγράμματος σπουδών που σχετίζονται με δίκτυα υπολογιστών, συστήματα...",
        categories: [],
        tags: [],
        id: 108
      });
      
      
      idx.add({
        title: "Εργαστήριο Κβαντικών και μή Συμβατικών Υπολογισμών(QUITLab)",
        excerpt: "Our current areas of research include: Quantum Automata Automata on infinite inputs Modeling with Membrane automata SPARQL Queries and Finite...",
        categories: [],
        tags: [],
        id: 109
      });
      
      
  

  

  
    
    
      idx.add({
        title: "Διοικητική Πληροφοριακών Συστημάτων",
        excerpt: "\n",
        categories: [],
        tags: [],
        id: 110
      });
      
      
      idx.add({
        title: "Τεχνητή Νοημοσύνη",
        excerpt: "\n",
        categories: [],
        tags: [],
        id: 111
      });
      
      
      idx.add({
        title: "Σχεδίαση της Διάδρασης Ανθρώπου-Υπολογιστή",
        excerpt: "\n",
        categories: [],
        tags: [],
        id: 112
      });
      
      
      idx.add({
        title: "Ερευνητικές Μέθοδοι",
        excerpt: "\n",
        categories: [],
        tags: [],
        id: 113
      });
      
      
  

  

  
    
    
      idx.add({
        title: "Εγγραφή Πρωτοετών Φοιτητών 2016-2017",
        excerpt: "Για το σκοπό αυτό η Γραμματεία χρειάζεται να έχει: εκτυπωμένη την αίτηση εγγραφής που υποβλήθηκε από τους επιτυχόντες ηλεκτρονικά στην...",
        categories: ["secretary"],
        tags: [],
        id: 114
      });
      
      
      idx.add({
        title: "Διοργάνωση συνεδρίου του έργου ADRIATinn",
        excerpt: "Το έργο στοχεύει στην προώθηση και υποστήριξη της καινοτομίας μέσω της ανάπτυξης ενός διασυνοριακού οικοσυστήματος το οποίο στηρίζει την συνεχή...",
        categories: ["conference"],
        tags: [],
        id: 115
      });
      
      
      idx.add({
        title: "Έναρξη Μαθημάτων Προπτυχιακού",
        excerpt: "Τα μαθήματα του Προπτυχιακού ξεκινούν την Δευτέρα 3 Οκτωβρίου 2016. Το ωρολόγιο πρόγραμμα του 1ου εξαμήνου μπορείτε να το δείτε...",
        categories: ["secretary"],
        tags: [],
        id: 116
      });
      
      
      idx.add({
        title: "Clifford Kentros Guest Lecture",
        excerpt: "Ο Καθηγητής Ιατρικής, Clifford Kentros, που ηγείται ερευνητικής ομάδας των διάσημων Νομπελιστών May-Britt και Edvard Moser (2014), θα επισκεφτεί την...",
        categories: ["guest lecture"],
        tags: [],
        id: 117
      });
      
      
      idx.add({
        title: "2ο Παγκόσμιο Συνέδριο GeNeDis 2016",
        excerpt: "Το συνέδριο θα επικεντρωθεί στις πρόσφατες εξελίξεις που αφορούν τους παραπάνω τομείς ξεκινώντας από την πρόοδο στο ερευνητικό πεδίο και...",
        categories: [],
        tags: ["conference"],
        id: 118
      });
      
      
  

  

  
    
    
      idx.add({
        title: "Cultural Understanding through Learning and Technology (CULT)",
        excerpt: "Οι σχέσεις απομακρυσμένων κοινοτήτων θα μπορούσαν να ενισχυθούν διαμέσου των νέων τεχνολογιών επικοινωνίας από απόσταση (π.χ. WiFi, Bluetooth, Δημόσιες οθόνες,...",
        categories: [],
        tags: [],
        id: 119
      });
      
      
      idx.add({
        title: "Discovery Space(D-Space)",
        excerpt: "Το έργο Discovery Space (D-Space) παρέχει τη δυνατότητα πρόσβασης και από κοινού χρήσης εργαλείων και εκπαιδευτικών πηγών όχι μόνο σε...",
        categories: [],
        tags: [],
        id: 120
      });
      
      
      idx.add({
        title: "Μοντελοποίηση της Δυναμικής Αυτοοργάνωσης και της Καταστολής του πληθυσμού του δάκου σε πραγματικό Οικο-Σύστημα του Δήμου Αγίου Γεωργίου, Κέρκυρας(Δάκος)",
        excerpt: "Ο δάκος είναι ο σοβαρότερος εχθρός της ελαιοπαραγωγής, προκαλώντας κάθε χρόνο πολλές σημαντικές οικονομικές ζημιές, τόσο με την υποβάθμιση των...",
        categories: [],
        tags: [],
        id: 121
      });
      
      
      idx.add({
        title: "ΕΠΕΑΕΚ: ΕΝΘΑΡΡΥΝΣΗ ΕΠΙΧΕΙΡΗΜΑΤΙΚΩΝ ΔΡΑΣΕΩΝ, ΚΑΙΝΟΤΟΜΙΚΩΝ ΕΦΑΡΜΟΓΩΝ ΚΑΙ ΜΑΘΗΜΑΤΩΝ ΕΠΙΛΟΓΗΣ ΦΟΙΤΗΤΩΝ ΚΑΙ ΣΠΟΥΔΑΣΤΩΝ",
        excerpt: "\n",
        categories: [],
        tags: [],
        id: 122
      });
      
      
      idx.add({
        title: "Πλατφόρμα για την δια-ακαδημαική συνεργασία στην καινοτομία(PaCiNNo)",
        excerpt: "Ο στόχος του έργου PACiNNO είναι η δημιουργία μιας πλατφόρμας για τη συνεργασία στον τομέα της έρευνας και της καινοτομίας...",
        categories: [],
        tags: [],
        id: 123
      });
      
      
      idx.add({
        title: "PromO(nto)tion",
        excerpt: "ΑΡΧΙΜΗΔΗΣ ΙΙΙ, ΕΣΠΑ 2007-2013 Για την υλοποίηση του εργαλείου θα χρησιμοποιηθούν οι νέες τεχνολογίες, και συγκεκριμένα θα σχεδιαστεί ένα εύχρηστο,...",
        categories: [],
        tags: [],
        id: 124
      });
      
      
      idx.add({
        title: "Μετάφραση για Μαζικά Ανοικτά Διαδικτυακά Μαθήματα(TraMOOC)",
        excerpt: "Διάρκεια: 01/02/2015 – 31/01/2018 Πρόγραμμα Χρηματοδότησης: Ηorizon 2020 Προϋπολογισμός έργου: 3,270,710.00€ Ο στόχος του έργου είναι η υψηλής ποιότητας αυτόματη...",
        categories: [],
        tags: [],
        id: 125
      });
      
      
  

  


console.log( jQuery.type(idx) );

var store = [
  
    
      
      
      
        
        {
          "title": "Αλέξανδρος Πανάρετος",
          "url": "/site-gem/gr/administrative-assistants/alex/",
          "excerpt": "education:\n\n  “BEng Software Engineering, Univerisity of Wales, Aberystwyth”\n  “MSc E-Commerce Technology, Essex University”\n\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Αθανάσιος Αλεξίου",
          "url": "/site-gem/gr/administrative-assistants/alexiou,md/",
          "excerpt": "### education:\n - PhD in Bioinformatics, Ionian University \n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Έλενα Λάσκαρι",
          "url": "/site-gem/gr/administrative-assistants/elena/",
          "excerpt": "\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Βαρβάρα Γαρνέλη",
          "url": "/site-gem/gr/administrative-assistants/garneli/",
          "excerpt": "education: BSc in Informatics, Athens University of Economics and Business MSc in Informatics and Humanistic Studies, Ionian University PhD in...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Κωνσταντίνος Γιαννάκης",
          "url": "/site-gem/gr/administrative-assistants/giannakis/",
          "excerpt": "education: Bachelor of Science (BSc),Ionian University, Dept. of Informatics Master of Science (MSc),Ionian University, Dept. of Informatics PhD in the...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ιωάννης Καρύδης",
          "url": "/site-gem/gr/administrative-assistants/karydis/",
          "excerpt": "education: “Phd , Auth, thesis: Mining and retrieval methods for acoustic and symbolic musical data.” “MSc Advanced Methods in Computer...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Πάτρικ Μικάλεφ",
          "url": "/site-gem/gr/administrative-assistants/mikalef/",
          "excerpt": "education: Bachelor of Science (BSc),Ionian University, Dept. of Informatics Master of Science in Business Informatics(MSc),Utrecht University PhD in IT Strategy,Ionian...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ηλίας Παππάς",
          "url": "/site-gem/gr/administrative-assistants/pappas/",
          "excerpt": "education:\n\n  PhD in E-Commerce,Ionian University, Dept. of Informatics\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Γεώργιος Παξινός",
          "url": "/site-gem/gr/administrative-assistants/paxinos/",
          "excerpt": "education:\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Μαρία Ψύχα",
          "url": "/site-gem/gr/administrative-assistants/psiha/",
          "excerpt": "education: Bachelor of Science (BSc),Ionian University, Dept. of Informatics Master of Science (MSc),Ionian University, Dept. of Informatics PhD in Bioinformatics,Ionian...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Σπύρος Βούλγαρης",
          "url": "/site-gem/gr/administrative-assistants/svoul/",
          "excerpt": "education:\n\n  “Πτυχίο, Τμήμα Ηλεκτρολόγων Μηχανικών και Μηχ. Η/Υ, Εθνικό Μετσόβιο Πολυτεχνείο”\n  “Μεταπτυχιακό, Τμήμα Αρχειονομίας και Βιβλιοθηκονομίας, Ιόνιο Παναεπιστήμιο”\n\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Σωτηρία-Σοφία Αρωνιάδα",
          "url": "/site-gem/gr/administrative-assistants/swthria/",
          "excerpt": "\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Bernd Wegner",
          "url": "/site-gem/gr/administrative-assistants/wegner/",
          "excerpt": "education:\n",
          "teaser":
            
              null
            
        },
      
    
  
    
  
    
      
      
      
        
        {
          "title": "Τεχνητή Νοημοσύνη",
          "url": "/site-gem/gr/courses/ai/",
          "excerpt": "Βιβλιογραφία: ““ΤΕΧΝΗΤΗ ΝΟΗΜΟΣΥΝΗ: ΜΙΑ ΣΥΓΧΡΟΝΗ ΠΡΟΣΕΓΓΙΣΗ”, Russell S., Norvig P. ΕΚΔΟΣΕΙΣ ΚΛΕΙΔΑΡΙΘΜΟΣ ΕΠΕ, ISBN 960-209-873-2, 2005” eudoxus link ““Τεχνητή Nοημοσύνη”,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Αλγόριθμοι",
          "url": "/site-gem/gr/courses/algorithms/",
          "excerpt": "Βιβλιογραφία: ““ΕΙΣΑΓΩΓΗ ΣΤΟΥΣ ΑΛΓΟΡΙΘΜΟΥΣ ΤΟΜΟΣ Ι”, CORMEN T.H., LEISERSON C.E., RIVEST R.L., STEIN C., Εκδόσεις ΙΤΕ-ΠΑΝΕΠΙΣΤΗΜΙΑΚΕΣ ΕΚΔΟΣΕΙΣ ΚΡΗΤΗΣ, ISBN 978-960-524-225-1,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Οργάνωση και Διοίκηση Επιχειρησέων",
          "url": "/site-gem/gr/courses/ba/",
          "excerpt": "Βιβλιογραφία:\n\n  ““ΟΡΓΑΝΩΣΙΑΚΗ ΘΕΩΡΙΑ ΚΑΙ ΣΧΕΔΙΑΣΜΟΣ”, RICHARD L. DAFT, Εκδόσεις Κλειδάριθμος, ISBN 960-209-846-5, 2005” eudoxus link\n\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Διαχείριση Μεγάλου Όγκου Δεδομένων ",
          "url": "/site-gem/gr/courses/big-data-management-technologies/",
          "excerpt": "Βιβλιογραφία: “Εξόρυξη από Μεγάλα Σύνολα Δεδομένων, Anand Rajaraman, Jeffrey David Ullman”eudoxus link ” Η ΜΕΘΟΔΟΣ PAGERANK ΤΗΣ GOOGLE ΚΑΙ ΑΛΛΑ...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Μαθηματικός Λογισμός",
          "url": "/site-gem/gr/courses/calculus/",
          "excerpt": "Βιβλιογραφία: “Απειροστικός λογισμός, Παναγιωτόπουλος Αντώνιος Χ., Σαπουνάκης Αριστείδης, Εκδόσεις Σταμούλη, 1989” “Απειροστικός λογισμός, Παναγιωτόπουλος Αντώνιος Χ., Σαπουνάκης Αριστείδης, Εκδόσεις Σταμούλη,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Μεταγλωττιστές",
          "url": "/site-gem/gr/courses/compilers/",
          "excerpt": "Βιβλιογραφία: ” Μεταγλωττιστές, Alfred V. Aho, Monica S. Lam, Ravi Sethi, Jeffrey D. Ullman” eudoxus link ” Μεταγλωττιστές, Παπασπύρου Νικόλαος...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Θεωρία Υπλογισμού",
          "url": "/site-gem/gr/courses/computation-theory/",
          "excerpt": "Βιβλιογραφία: ““ΕΙΣΑΓΩΓΗ ΣΤΗ ΘΕΩΡΙΑ ΥΠΟΛΟΓΙΣΜΟΥ”, SIPSER MICHAEL, Εκδόσεις ΙΤΕ-ΠΑΝΕΠΙΣΤΗΜΙΑΚΕΣ ΕΚΔΟΣΕΙΣ ΚΡΗΤΗΣ, ISBN 978-960-524-243-5, 2009”eudoxus link ““Στοιχεία θεωρίας υπολογισμού”, Lewis Harry...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Αρχιτεκτονική Υπολογιστών",
          "url": "/site-gem/gr/courses/computer-architecture/",
          "excerpt": "Βιβλιογραφία: “D.A.Patterson &amp; J.L.Hennessy, “Οργάνωση και Σχεδίαση Υπολογιστών (Τόμος Α’)” , 4η έκδοση, Κλειδάριθμος, 2010.” eudoxus link “W. Stallings, “Οργάνωση...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Γραφικά με Υπολογιστές",
          "url": "/site-gem/gr/courses/computer-graphics/",
          "excerpt": "Βιβλιογραφία: “Γραφικά και Οπτικοποίηση”, Θεοχάρης Θ., Πλατής Ν., Παπαϊωάννου Γ., Πατρικαλάκης Ν., Εκδόσεις Συμμετρία, ISBN 978-960-266-296-0, 2010”eudoxus link “Γραφικά με...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Προγραμματισμός Υπολογιστών",
          "url": "/site-gem/gr/courses/computer-programming/",
          "excerpt": "Βιβλιογραφία: “C Προγραμματισμός”, 6η Έκδοση, Paul Deitel, Harvey Deitel, Εκδόσεις Α. Γκιούρδα &amp; ΣΙΑ ΟΕ, ISBN 978-960-512-5912, 2011”eudoxus link “ΜΑΘΕΤΕ...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Διδακτική της Πληροφορικής",
          "url": "/site-gem/gr/courses/computing-education/",
          "excerpt": "Βιβλιογραφία: “Εισαγωγή στη διδακτική της πληροφορικής, Βασίλης Ι. Κόμης, Εκδόσεις Κλειδάριθμος”eudoxus link “Εισαγωγή στη διδακτική της πληροφορικής, Ν. Αλεξανδρής, Β....",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Κρυπτογραφία",
          "url": "/site-gem/gr/courses/cryptography/",
          "excerpt": "Βιβλιογραφία: “Κρυπτογραφία και ασφάλεια δικτύων – αρχες και εφαρμογες. William Stallings, ΙΩΝ 2012.”eudoxus link “Σύγχρονη Κρυπτογραφία – Θεωρία και Εφαρμογές....",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Κινητά και Κοινωνικά Μέσα",
          "url": "/site-gem/gr/courses/cscw/",
          "excerpt": "Βιβλιογραφία: ““Επικοινωνία ανθρώπου – υπολογιστή, 3ή Έκδοση”, Dix Alan J., Finlay Janet E., Abowd Gregory D., Beale Russell, Εκδόσεις Α....",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Αποθήκες Δεδομένων και Εξόρυξη Γνώσης",
          "url": "/site-gem/gr/courses/data-mining-and-data-warehousing/",
          "excerpt": "Βιβλιογραφία: “Εισαγωγή στην εξόρυξη δεδομένων, Tan Pang - Ning,Steinbach Michael,Kumar Vipin” eudoxus link “Εισαγωγή στην Εξόρυξη Δεδομένων και τις Αποθήκες...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Δομές Δεδομένων",
          "url": "/site-gem/gr/courses/data-structures/",
          "excerpt": "Βιβλιογραφία: “Δομές δεδομένων, αλγόριθμοι και εφαρμογές C++”, Sahnii Sartaj, Εκδόσεις ΤΖΙΟΛΑ, ISBN 978-960-418-030-1, 2004”eudoxus link “ΔΟΜΕΣ ΔΕΔΟΜΕΝΩΝ”, ΓΕΩΡΓΑΚΟΠΟΥΛΟΣ Γ.Φ., Εκδόσεις...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Βάσεις Δεδομένων Ι",
          "url": "/site-gem/gr/courses/databases1/",
          "excerpt": "Βιβλιογραφία: ““Συστήματα Βάσεων Δεδομένων”, Silberschatz, Korth, Suda, Εκδόσεις Α. Γκιούρδα, ISBN 978-960-512-384-0, 2004” ““ΣΧΕΔΙΑΣΜΟΣ ΒΑΣΕΩΝ ΔΕΔΟΜΕΝΩΝ”, ΓΕΩΡΓΙΟΣ ΒΑΣΙΛΑΚΟΠΟΥΛΟΣ, Εκδόσεις Γ....",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Βάσεις Δεδομένων ΙΙ",
          "url": "/site-gem/gr/courses/databases2/",
          "excerpt": "Βιβλιογραφία: ““Θεμελιώδεις αρχές συστημάτων βάσεων δεδομένων”, Elmasri Ramez,Navathe Shamkant B, Εκδόσεις Δίαυλος, ISBN 978-960-531-220-6, 2008” ““Συστήματα Βάσεων Δεδομένων”, Ιωάννης Μανωλόπουλος...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ψηφιακή Επεξεργασία Εικόνας",
          "url": "/site-gem/gr/courses/digit-image-process/",
          "excerpt": "Βιβλιογραφία: “ΨΗΦΙΑΚΗ ΕΠΕΞΕΡΓΑΣΙΑ ΕΙΚΟΝΑΣ”, ΙΩΑΝΝΗΣ ΠΗΤΑΣ, Εκδόσεις ΙΩΑΝΝΗΣ ΠΗΤΑΣ, 2010” “Ψηφιακή Επεξεργασία και Ανάλυση Εικόνας”, Παπαμάρκος Νικόλαος, Αυτοέκδοση, ISBN 978-960-92731-3-8,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Διακριτά Μαθηματικά",
          "url": "/site-gem/gr/courses/discrete-mathematics/",
          "excerpt": "Βιβλιογραφία: “Διακριτά μαθηματικά”, Παναγιωτόπουλος Αντώνιος Χ., Εκδόσεις Σταμούλη, ISBN 960-351-227-3, 1999eudoxus link “ΣΤΟΙΧΕΙΑ ΔΙΑΚΡΙΤΩΝ ΜΑΘΗΜΑΤΙΚΩΝ”, LIU C.L., Εκδόσεις ΙΤΕ-ΠΑΝΕΠΙΣΤΗΜΙΑΚΕΣ ΕΚΔΟΣΕΙΣ...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Κατανεμημένα Δικτυοκεντρικά Συστήματα",
          "url": "/site-gem/gr/courses/distributed-network-systems/",
          "excerpt": "Βιβλιογραφία: ““ΚΑΤΑΝΕΜΗΜΕΝΑ ΣΥΣΤΗΜΑΤΑ: ΑΡΧΕΣ ΚΑΙ ΥΠΟΔΕΙΓΜΑΤΑ”, ANDREW S. TANENBAUM, MAARTEN VAN STEEN” eudoxus link ““ΚΑΤΑΝΕΜΗΜΕΝΑ ΣΥΣΤΗΜΑΤΑ ΜΕ JAVA”, Ι. Κ....",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Συστήματα Υποστήριξης Αποφάσεων",
          "url": "/site-gem/gr/courses/dss/",
          "excerpt": "Βιβλιογραφία: “Συστήματα υποστήριξης αποφάσεων”, Ματσατσίνης Ν., Εκδόσεις Νέων Τεχνολογιών, 2010, ISBN 978-960-6759-44-4 eudoxus link “Διοικητική επιστήμη”, Πραστάκος Γρηγόρης Π., Εκδόσεις...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ηλεκτρονική Διακυβέρνηση",
          "url": "/site-gem/gr/courses/e-government/",
          "excerpt": "Βιβλιογραφία: “”Εισαγωγή στην ηλεκτρονική διακυβέρνηση” , Πομπόρτσης Ανδρέας, Εκδόσεις ΤΖΙΟΛΑ, ISBN 960-418-083-5, 2006” eudoxus link “”Ηλεκτρονική δημόσια διοίκηση” , Αποστολάκης...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ηλεκτρονικό Επιχειρείν",
          "url": "/site-gem/gr/courses/ecommerce/",
          "excerpt": "Βιβλιογραφία: “Ηλεκτρονικό εμπόριο 2008”, Turban E., King D., McKay J., Marshall P., Lee J., Viehland D., Volonino L., Cheung Ch.,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Τεχνολογία Ψυχαγωγικού Λογισμικού & Εικονικοί Κόσμοι",
          "url": "/site-gem/gr/courses/entertainment-technology-software-and-virtual-worlds/",
          "excerpt": "Βιβλιογραφία:\n\n  “ΒΙΝΤΕΟΠΑΙΧΝΙΔΙΑ: ΒΙΟΜΗΧΑΝΙΑ ΚΑΙ ΑΝΑΠΤΥΞΗ, ΚΩΣΤΑΣ ΑΝΑΓΝΩΣΤΟΥ”eudoxus link\n  “Εικονικά περιβάλλοντα πληροφόρησης, Κόκοτος Δημήτριος Χ.”eudoxus link\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Καινοτομία και Επιχειρηματικότητα",
          "url": "/site-gem/gr/courses/entrepreneurship-innovation/",
          "excerpt": "Βιβλιογραφία: “Η. Γ. Καραγιάννης, Ι. Λ. Μπακούρος, “Καινοτομία &amp; Επιχειρηματικότητα: Θεωρία – Πράξη”, Εκδόσεις Σοφία, 2010.” eudoxus link “Πιπερόπουλος Πάνος...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Επικοινωνία Ανθρώπου-Υπολογιστή",
          "url": "/site-gem/gr/courses/hci/",
          "excerpt": "Βιβλιογραφία: “Επικοινωνία ανθρώπου – υπολογιστή, 3ή Έκδοση, Dix Alan J., Finlay Janet E., Abowd Gregory D., Beale Russell, Εκδόσεις Α....",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Πληροφορική στις Ανθρωπιστικές Επιστήμες",
          "url": "/site-gem/gr/courses/humanistic-informatics/",
          "excerpt": "Βιβλιογραφία: “ΤΕΧΝΟΛΟΓΙΕΣ ΠΛΗΡΟΦΟΡΙΩΝ ΚΑΙ ΕΠΙΚΟΙΝΩΝΙΑΣ &amp; ΚΟΙΝΩΝΙΑ, Ιωάννης Σ. Κουμπούρος”eudoxus link “Υπηρεσίες προστιθέμενης αξίας στο διαδίκτυο, Μήλιου Αμαλία Ν.,Πομπόρτσης Ανδρέας...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Πολιτικές και Τεχνολογίες Ασφάλειας και Ιδιωτικότητας",
          "url": "/site-gem/gr/courses/info-privacy-security-polices-enhancing-tech/",
          "excerpt": "Βιβλιογραφία: “Προστασία της Ιδιωτικότητας και Τεχνολογίες Πληροφορικής και Επικοινωνιών: Τεχνικά και Νομικά Θέματα, Λαμπρινουδάκης Κ., Μήτρου Λ., Γκρίτζαλης Σ. και...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ανάλυση και Σχεδιασμός Π.Σ.",
          "url": "/site-gem/gr/courses/info-systems-analysis-and-design/",
          "excerpt": "Βιβλιογραφία: “Alan Dennis. Barbara Haley Wixom, David Tegarden (2010) Ανάλυση &amp; Σχεδιασμός Συστημάτων με τη UML 2.0: Μια αντικειμενοστρεφής Προσέγγιση,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Αναπαράσταση Πληροφοριών και Γνώσης",
          "url": "/site-gem/gr/courses/information-and-knowledge-representation/",
          "excerpt": "Βιβλιογραφία: “Εξόρυξη γνώσης από βάσεις δεδομένων και τον παγκόσμιο ιστό, Βαζιργιάννης Μιχάλης, Χαλκίδη Μαρία”eudoxus link “Εισαγωγή στην εξόρυξη δεδομένων, Tan...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ανάκτηση Πληροφορίας ",
          "url": "/site-gem/gr/courses/information-retrieval/",
          "excerpt": "Βιβλιογραφία: “ΕΙΣΑΓΩΓΗ ΣΤΗΝ ΑΝΑΚΤΗΣΗ ΠΛΗΡΟΦΟΡΙΩΝ”, CHRISTOPHER D. MANNING, PRABHAKAR RAGHAVAN, HINRICH eudoxus link “Ανάκτηση Πληροφορίας”, 2η Έκδοση, Baeza-Yates Ricardo, Ribeiro-Neto...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Πληροφοριακά Συστήματα και Εφοδιαστική Αλυσίδα",
          "url": "/site-gem/gr/courses/information-systems-and-supply-management/",
          "excerpt": "Βιβλιογραφία: -“Πληροφοριακά Συστήματα Διαχείρισης Επιχειρησιακών Πόρων:Στρατηγικές &amp; Εφαρμογές, Γιάννης Πολλάλης, Αθανάσιος Βοζίκης”eudoxus link -“ΣΥΓΧΡΟΝΑ ΕΠΙΧΕΙΡΗΣΙΑΚΑ ΣΥΣΤΗΜΑΤΑ, ΚΩΝΣΤΑΝΤΙΝΟΣ Ι. ΣΤΕΦΑΝΟΥ, ΧΡΗΣΤΟΣ...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Διοίκηση Ασφάλειας Πληροφοριακών Συστημάτων",
          "url": "/site-gem/gr/courses/information-systems-security-management/",
          "excerpt": "Βιβλιογραφία:\n\n  “Διαχείριση Ασφάλειας Πληροφοριών, Σωκράτης Κάτσικας”eudoxus link\n  “Ασφάλεια Πληροφοριακών Συστημάτων, Σωκτ. Κάτσικας - Δ. Γκρίτζαλης - Στεφ. Γκρίτζαλης”eudoxus link\n\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Θεωρία της Πληροφορίας",
          "url": "/site-gem/gr/courses/information-theory/",
          "excerpt": "Βιβλιογραφία: ““Εισαγωγή στη θεωρία της πληροφορίας”, Αφράτη Φώτω, Εκδόσεις Συμμετρία, 1994”[eudoxus link}(https://service.eudoxus.gr/search/#a/id:45421/0) ““Εισαγωγή στη θεωρία Πληροφοριών, Κωδίκων και Κρυπτογραφίας”, Ν....",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Τεχνολογίες Διαδικτύου",
          "url": "/site-gem/gr/courses/internet-technologies/",
          "excerpt": "Βιβλιογραφία: “Ανάπτυξη Web Εφαρμογών με PHP και MySQL”, Welling Luke,Thomson Laura, Εκδόσεις Α. Γκιούρδα, ISBN 960-512-357-6, 2005”eudoxus link “ΑΡΧΙΤΕΚΤΟΝΙΚΗ ΠΛΑΤΦΟΡΜΑΣ...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Εισαγωγή στην Επιστήμη των Υπολογιστών",
          "url": "/site-gem/gr/courses/introduction-computer-science/",
          "excerpt": "Βιβλιογραφία: “Εισαγωγή στη σύγχρονη επιστήμη των υπολογιστών, Lister Andrew M., Εκδόσεις Δίαυλος, ISBN 978-960-7140-65-4, 2000” “Εισαγωγή στην επιστήμη των Υπολογιστών,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Εισαγωγή στον Προγραμματισμό",
          "url": "/site-gem/gr/courses/itp/",
          "excerpt": "Βιβλιογραφία: “C Προγραμματισμός”, 7η Έκδοση, Paul Deitel, Harvey Deitel, Εκδόσεις Χ. ΓΚΙΟΥΡΔΑ &amp; ΣΙΑ ΕΕ, ISBN 978-960-512-6414, 2014” eudoxus link...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": " Γλωσσική Τεχνολογία",
          "url": "/site-gem/gr/courses/language-technology/",
          "excerpt": "Βιβλιογραφία: ““Η μηχανική μετάφραση και η ελληνική γλώσσα”, Σταύρου Μ., Τζεβελέκου Μ., Ινστιτούτο Επεξεργασίας του Λόγου, Εκδόσεις Καστανιώτη, ISBN 960-03-2718-1,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Γραμμική Άλγεβρα",
          "url": "/site-gem/gr/courses/linear-algebra/",
          "excerpt": "Βιβλιογραφία: “Μια Εισαγωγή στη Γραμμική Άλγεβρα Τόμος Ι, ΒΑΡΣΟΣ, ΔΕΡΙΖΙΩΤΗΣ, ΕΜΜΑΝΟΥΗΛ, ΜΑΛΙΑΚΑΣ, ΜΕΛΑΣ, ΤΑΛΕΛΛΗ, Εκδόσεις ΣΟΦΙΑ, 2008” “ΕΙΣΑΓΩΓΗ ΣΤΗΝ ΓΡΑΜΜΙΚΗ...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Λογικός Προγραμματισμός",
          "url": "/site-gem/gr/courses/logic-programming/",
          "excerpt": "Βιβλιογραφία: “Μητακίδης Γιώργος, “Από τη λογική στο λογικό προγραμματισμό και την Prolog”, Εκδόσεις ΚΑΡΔΑΜΙΤΣΑ, 1992.” eudoxus link “ΝΟΤΟΠΟΥΛΟΣ ΠΑΝΑΓΙΩΤΗΣ, “ΠΡΟΓΡΑΜΜΑΤΙΖΟΝΤΑΣ...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Διαχείριση Έργων Πληροφορικής",
          "url": "/site-gem/gr/courses/management-of-it-projects/",
          "excerpt": "Βιβλιογραφία:\n\n  “Διαχείριση έργων πληροφορικής, Κιουντούζης Ευάγγελος Α.”eudoxus link\n  “Διαχείριση έργου - project management, Burke Rory”eudoxus link\n\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Μαθηματικός Προγραμματισμός",
          "url": "/site-gem/gr/courses/mathematical-programming/",
          "excerpt": "Βιβλιογραφία:\n\n  “Γραμμικός Προγραμματισμός», Γ. Σίσκος, 2000, ΕΚΔΟΣΕΙΣ ΝΕΩΝ ΤΕΧΝΟΛΟΓΙΩΝ”eudoxus link\n  “Γραμμικός Προγραμματισμός», Δημήτρης Δεσπότης, 2011, ΕΚΔΟΣΕΙΣ ΔΕΣΠΟΤΗΣ ΔΗΜΗΤΡΙΟΣ”eudoxus link\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Εισαγωγή στα Πληροφοριακά Συστήματα",
          "url": "/site-gem/gr/courses/mis/",
          "excerpt": "Βιβλιογραφία: “Κιουντούζης, Ε. (2009) ”Μεθοδολογίες Ανάλυσης και Σχεδιασμού Πληροφοριακών Συστημάτων” , Εκδόσεις Μπένου (3η Έκδοση), Αθήνα.” eudoxus link “Avison, D.,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Πολυμέσα",
          "url": "/site-gem/gr/courses/multimedia/",
          "excerpt": "Βιβλιογραφία: Τεχνολογία πολυμέσων, Δημητριάδης Σταύρος Ν., Πομπόρτσης Ανδρέας Σ., Τριανταφύλλου Ευάγγελος Γ., Εκδόσεις ΤΖΙΟΛΑ, ISBN 978-960-418-025-7, 2004 Πολυμέσα Θεωρία και...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Δίκτυα I",
          "url": "/site-gem/gr/courses/networks1/",
          "excerpt": "Βιβλιογραφία: ““Δίκτυα Επικοινωνιών, ένα πρώτο μάθημα”, Jean Walrand, Μετάφραση-Επιμέλεια: Ιωάννης Σταυρακάκης, Λάζαρος Μεράκος, Εκδόσεις ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΚΟΝΔΥΛΙΩΝ ΕΡΕΥΝΑΣ – ΕΚΠΑ,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Δίκτυα II",
          "url": "/site-gem/gr/courses/networks2/",
          "excerpt": "Βιβλιογραφία: ““ΔΙΚΤΥΑ ΥΠΟΛΟΓΙΣΤΩΝ: ΜΙΑ ΠΡΟΣΕΓΓΙΣΗ ΑΠΟ ΤΗ ΣΚΟΠΙΑ ΤΩΝ ΣΥΣΤΗΜΑΤΩΝ”, LARRY L. PETERSON, BRUCE S. DAVIE, Εκδόσεις Κλειδάριθμος, ISBN 978-960-461-266-6,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Αντικειμενοστρεφής Προγραμματισμός",
          "url": "/site-gem/gr/courses/object-oriented-programming/",
          "excerpt": "Βιβλιογραφία: ““Java προγραμματισμός”, 10η Έκδοση, Paul Deitel, Harvey Deitel, Εκδόσεις Χ. ΓΚΙΟΥΡΔΑ ΣΙΑ ΕΕ, ISBN 978-960-512-6810, 2015”eudoxus link ““Java Eισαγωγή...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Λειτουργικά Συστήματα",
          "url": "/site-gem/gr/courses/operating-systems/",
          "excerpt": "Βιβλιογραφία: ““Λειτουργικά Συστήματα Αρχές Σχεδίασης”, William Stallings, 8η Έκδοση, Εκδόσεις Τζιόλα”eudoxus link ““ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΣΕ UNIX”,MARC J. ROCHKIND, ΕΚΔΟΣΕΙΣ ΚΛΕΙΔΑΡΙΘΜΟΣ”eudoxus link...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Παράλληλος Προγραμματισμός",
          "url": "/site-gem/gr/courses/parallel-programming/",
          "excerpt": "Βιβλιογραφία: “Peter S. Pacheco, ”Εισαγωγή στον Παράλληλο Προγραμματισμό” , ΚΛΕΙΔΑΡΙΘΜΟΣ, 2015.” [eudoxus link] (https://service.eudoxus.gr/search/#a/id:50656351/0) “Γραμματή Πάντζιου, Βασίλειος Μάμαλης, Αλέξανδρος Τομαράς...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Αναγνώριση Προτύπων",
          "url": "/site-gem/gr/courses/pattern-recognition/",
          "excerpt": "Βιβλιογραφία: ““Αναγνώριση προτύπων”, ΣΤΡΙΝΤΖΗΣ Μ., Εκδόσεις Αδελφοί Κυριακίδη, ISBN 978-960-343-290-6, 2007” [eudoxus link] (https://service.eudoxus.gr/search/#a/id:6378/0) ““Ευφυής έλεγχος”, Κινγκ Ρ., Εκδόσεις ΤΖΙΟΛΑ,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Μοντέλα Κβαντικού και Μοριακού Υπολογισμού",
          "url": "/site-gem/gr/courses/quantum-dna-computing/",
          "excerpt": "Βιβλιογραφία: “ΚΒΑΝΤΙΚΟΙ ΥΠΟΛΟΓΙΣΤΕΣ: ΒΑΣΙΚΕΣ ΕΝΝΟΙΕΣ”, Ιωάννης Καραφυλλίδης, Εκδόσεις ΚΛΕΙΔΑΡΙΘΜΟΣ, ISBN 978-960-209-816-5, 2005.” “Το νέο κβαντικό σύμπαν”, T.HEY, P.WALTERS, Εκδόσεις ΑΛ....",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ασφάλεια υπολογιστών και προστασία δεδομένων",
          "url": "/site-gem/gr/courses/security/",
          "excerpt": "Βιβλιογραφία: “”Ασφάλεια Πληροφοριακών Συστημάτων” Κ. Κάτσικας, Δ. Γκρίτζαλης, Σ. Γκρίτζαλης. Νέων Τεχνολογιών, 2004.” eudoxus link “”Βασικές Αρχές Ασφάλειας Δικτύων” W....",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Σημασιολογικός και Κοινωνικός Ιστός",
          "url": "/site-gem/gr/courses/semantic-and-social-web/",
          "excerpt": "Βιβλιογραφία: “ΕΙΣΑΓΩΓΗ ΣΤΟ ΣΗΜΑΣΙΟΛΟΓΙΚΟ ΙΣΤΟ, GRIGORIS ANTONIOU, FRANK VAN HARMELEN”eudoxus link “Εξόρυξη γνώσης από βάσεις δεδομένων και τον παγκόσμιο ιστό,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Προσομοίωση και Μοντελοποίηση",
          "url": "/site-gem/gr/courses/simulation-modeling/",
          "excerpt": "Βιβλιογραφία: ““Προσομοίωση διακριτών συστημάτων”, Khoshnevis Behrokh, Εκδόσεις Δίαυλος, ISBN 978-960-531-031-8, 1999” eudoxus link ““Προσομοίωση δικτύων υπολογιστών”, Πομπόρτσης Ανδρέας Σ., Τσουλφάς...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Κοινωνικά και Νομικά Θέματα των ΤΠΕ",
          "url": "/site-gem/gr/courses/social-and-legal-issues-of-icts/",
          "excerpt": "Βιβλιογραφία:\n\n  “Το δίκαιο του διαδικτύου (internet), Σιδηρόπουλος Θεόδωρος”eudoxus link\n  “Το δίκαιο του ηλεκτρονικού εμπορίου, Αλεξανδρίδου Ελίζα Δ.”eudoxus link\n\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Τεχνολογία Λογισμικού",
          "url": "/site-gem/gr/courses/software-engineering/",
          "excerpt": "Βιβλιογραφία: ““Ο ΠΡΑΚΤΙΚΟΣ ΠΡΟΓΡΑΜΜΑΤΙΣΤΗΣ”, ANDREW HUNT, DAVID THOMAS, Εκδόσεις Κλειδάριθμος, ISBN 978-960-461-135-5, 2008”eudoxus link ““ΑΝΑΓΝΩΣΗ ΚΩΔΙΚΑ”, ΔΙΟΜΗΔΗΣ ΣΠΙΝΕΛΛΗΣ, Εκδόσεις Κλειδάριθμος,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ειδικά Θέματα Ασφάλειας Πληροφοριών",
          "url": "/site-gem/gr/courses/specific-information-security-issues/",
          "excerpt": "Βιβλιογραφία: ” ΒΑΣΙΚΕΣ ΑΡΧΕΣ ΑΣΦΑΛΕΙΑΣ ΔΙΚΤΥΩΝ: ΕΦΑΡΜΟΓΕΣ ΚΑΙ ΠΡΟΤΥΠΑ”, WILLIAM STALLINGS eudoxos link ” Ασφάλεια Πληροφοριακών Συστημάτων”, Σωκτ. Κάτσικας -...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Επεξεργασία Ομιλίας και Ήχου",
          "url": "/site-gem/gr/courses/speech-processing/",
          "excerpt": "Βιβλιογραφία:\n\n  “Ψηφιακή επεξεργασία σήματος, Antoniou A.”eudoxus link\n  “Ψηφιακή Επεξεργασία Φωνής: Θεωρία και Εφαρμογές, Rabiner L.”eudoxus link\n\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Στατιστική ",
          "url": "/site-gem/gr/courses/statistics/",
          "excerpt": "Βιβλιογραφία: “Περιγραφική και διερευνητική στατιστική ανάλυση δεδομένων”, Γεωργιακώδης Φώτης A.,Τσίμπος Κλέων Χ., Εκδόσεις Σταμούλη, ISBN 978-960-351-315-6, 2000”eudoxus link “Πιθανότητες, τυχαίες...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Στρατηγική και Διοίκηση Πληροφοριακών Συστημάτων",
          "url": "/site-gem/gr/courses/strategic-management-of-information-systems/",
          "excerpt": "Βιβλιογραφία: “ΠΛΗΡΟΦΟΡΙΑΚΑ ΣΥΣΤΗΜΑΤΑ ΔΙΟΙΚΗΣΗΣ, KENNETH C. LAUDON, JANE P. LAUDON”eudoxus link “ΚΑΙΝΟΤΟΜΙΑ, ΣΤΡΑΤΗΓΙΚΗ, ΑΝΑΠΤΥΞΗ ΚΑ ΠΛΗΡΟΦΟΡΙΑΚΑ ΣΥΣΤΗΜΑΤΑ, Γεώργιος Δουκίδης”eudoxus link...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Πιθανότητες",
          "url": "/site-gem/gr/courses/theory-of-probability/",
          "excerpt": "Βιβλιογραφία: “ΕΙΣΑΓΩΓΗ ΣΤΗ ΘΕΩΡΙΑ ΠΙΘΑΝΟΤΗΤΩΝ”, HOEL P., PORT S., STONE C., Εκδόσεις ΙΤΕ-ΠΑΝΕΠΙΣΤΗΜΙΑΚΕΣ ΕΚΔΟΣΕΙΣ ΚΡΗΤΗΣ, ISBN 978-960-524-156-8, 2009”eudoxus link “Πιθανότητες,...",
          "teaser":
            
              null
            
        },
      
    
  
    
  
    
  
    
      
      
      
        
        {
          "title": "Θεόδωρος Ανδρόνικος",
          "url": "/site-gem/gr/faculty/andronikos/",
          "excerpt": "education: “Δίπλωμα Ηλεκτρολόγου Μηχανικού και Μηχανικού Υπολογιστών με κατεύθυνση Πληροφορικής από τη Σχολή Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών του Εθνικού...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Αγγελική Τσώχου",
          "url": "/site-gem/gr/faculty/atsohou/",
          "excerpt": "education: “Πτυχίο Πληροφορικής, Τμήμα Πληροφορικής, Οικονομικό Πανεπιστήμιο Αθηνών” “Μεταπτυχιακό Δίπλωμα Ειδίκευσης, MSc: «Πληροφοριακά Συστήματα», Τμήμα Πληροφορικής, Οικονομικό Πανεπιστήμιο Αθηνών” “Διδακτορικό...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Μάρκος Αυλωνίτης",
          "url": "/site-gem/gr/faculty/avlonitis/",
          "excerpt": "education:\n\n  “Πτυχίο Φυσικής, Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης, Σχολή Θετικών Επιστημών”\n  “Διδακτορικό Δίπλωμα στη Μηχανική, Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης, Πολυτεχνική Σχολή”\n\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Κωνσταντίνος Χωριανόπουλος",
          "url": "/site-gem/gr/faculty/choko/",
          "excerpt": "education: “Δίπλωμα Ηλεκτρονικών Μηχανικών και Μηχανικών Υπολογιστών, Πολυτεχνείο Κρήτης” “Μεταπτυχιακό Μάρκετινγκ και Επικοινωνία με Νέες Τεχνολογίες, Τμήμα Μάρκετινγκ και Επικοινωνίας,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Χρήστος Αναγνωστόπουλος",
          "url": "/site-gem/gr/faculty/christos/",
          "excerpt": "education: “Πτυχίο Τμήματος Πληροφορικής και Τηλεπικοινωνιών, Εθνικό και Καποδιστριακό Πανεπιστήμιο Αθηνών” “Μεταπτυχιακό Δίπλωμα Ειδίκευσης “Προηγμένα Πληροφοριακά Συστήματα”, Τμήμα Πληροφορικής και...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Δημήτριος Τσουμάκος",
          "url": "/site-gem/gr/faculty/dtsouma/",
          "excerpt": "education: “Πτυχίο Ηλεκτρολόγου Μηχανικού και Μηχανικού Η/Υ, Τμήμα Ηλεκτρολόγων Μηχ. και Μηχ. Υπολογιστών, Εθνικό Μετσόβιο Πολυτεχνείο. Τίτλος Διπλωματικής Εργασίας: ‘Ηλεκτρονικός...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Εμμανουήλ Μάγκος",
          "url": "/site-gem/gr/faculty/emagos/",
          "excerpt": "education:\n\n  “Πτυχίο Πληροφορικής, Πανεπιστήμιο Πειραιώς”\n  “Διδακτορικό Δίπλωμα σε “Ασφαλή Ηλεκτρονικά Συστήματα Συναλλαγών μέσω Internet”, Πανεπιστήμιο Πειραιώς”\n\n\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Φοίβος Μυλωνάς",
          "url": "/site-gem/gr/faculty/fmylonas/",
          "excerpt": "education: “Δίπλωμα Ηλεκτρολόγου Μηχανικού και Μηχανικού Ηλεκτρονικών Υπολογιστών, Σχολή Ηλεκτρολόγων Μηχανικών και Μηχανικών Ηλεκτρονικών Υπολογιστών, Ε.Μ.Π., 2001” “Μεταπτυχιακό Δίπλωμα Ειδίκευσης...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Κάτια Λήδα Κερμανίδου",
          "url": "/site-gem/gr/faculty/kerman/",
          "excerpt": "education: “Δίπλωμα Ηλεκτρολόγων Μηχανικών και Τεχνολογίας Υπολογιστών, Πανεπιστήμιο Πατρών” “Διδακτορικό Δίπλωμα με τίτλο διατριβής «Αυτόματη Μάθηση Συντακτικών Εξαρτήσεων και Ανάπτυξη...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Μιχαήλ Στεφανιδάκης",
          "url": "/site-gem/gr/faculty/mistral/",
          "excerpt": "education: “Δίπλωμα Μηχανικού Ηλεκτρονικών Υπολογιστών και Πληροφορικής, Πανεπιστήμιο Πατρών” “Διδακτορικό Δίπλωμα με θέμα τη “Σχεδίαση και Μελέτη Απόδοσης Παράλληλης Αρχιτεκτονικής...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Κωνσταντίνος Οικονόμου",
          "url": "/site-gem/gr/faculty/okon/",
          "excerpt": "education: “Δίπλωμα Μηχανικού Ηλεκτρονικών Υπολογιστών και Πληροφορικής, Πανεπιστήμιο Πατρών” “Μεταπτυχιακό Δίπλωμα Ειδίκευσης, MSc in Communication and Signal Processing from the...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Αδαμαντία Πατέλη",
          "url": "/site-gem/gr/faculty/pateli/",
          "excerpt": "education: “Πτυχίο Πληροφορικής, Οικονομικό Πανεπιστήμιο Αθηνών” “ΜSc in Electronic Commerce, University of Manchester Institute of Science &amp; Technology” “Διδακτορικό Δίπλωμα...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Παναγιώτης Κουρουθανάσης",
          "url": "/site-gem/gr/faculty/pkour/",
          "excerpt": "education: “Πτυχίο Πληροφορικής, Οικονομικό Πανεπιστήμιο Αθηνών” “Μεταπτυχιακό δίπλωμα ειδίκευσης στις Επιστήμες των Αποφάσεων, Οικονομικό Πανεπιστήμιο Αθηνών” “Διδακτορικό δίπλωμα στα Πληροφοριακά...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Σπύρος Σιούτας",
          "url": "/site-gem/gr/faculty/sioutas/",
          "excerpt": "education: “Δίπλωμα Μηχανικού Η/Υ &amp; Πληροφορικής, Πανεπιστήμιο Πατρών” “Μεταπτυχιακό Δίπλωμα Ειδίκευσης, MSc: «Τεχνικές εξάλειψης κατανεμημένης πολυπλοκότητας και εφαρμογή τους στη...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Βασίλειος Χρυσικόπουλος",
          "url": "/site-gem/gr/faculty/vchris/",
          "excerpt": "education: “Δίπλωμα Φυσικομαθηματικής Σχολής Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης” “MSc στην Επιχειρησιακή Έρευνα, Chelsea College, London University” “PhD Royal Holloway, London University”...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Παναγιώτης Βλάμος ",
          "url": "/site-gem/gr/faculty/vlamos/",
          "excerpt": "education:\n\n  “Πτυχίο Μαθηματικών, Πανεπιστήμιο Αθηνών”\n  “Διδακτορικό Δίπλωμα στα Μαθηματικά, Τμήμα Εφαρμοσμένων Μαθηματικών και Φυσικών Επιστημών, Ε.Μ. Πολυτεχνείου.”\n\n\n",
          "teaser":
            
              null
            
        },
      
    
  
    
  
    
      
      
      
        
        {
          "title": "Εργαστηριακό Προσωπικό",
          "url": "/site-gem/gr/administrative-assistants/",
          "excerpt": "\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Προπτυχιακά Μαθήματα",
          "url": "/site-gem/gr/courses/",
          "excerpt": "Για το ακαδημαϊκό έτος 2015 – 2016 εισήχθησαν στο Τμήμα Πληροφορικής 200 φοιτητές/τριες με το σύστημα των Πανελληνίων Εξετάσεων από...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Προσωπικό",
          "url": "/site-gem/gr/faculty/",
          "excerpt": "ΔΙΔΑΚΤΙΚΟ Καθηγητές Αναπληρωτές Καθηγητές Επίκουροι Καθηγητές Καθηγητές Βασίλειος Χρυσικόπουλος Πληροφορική – Δίκτυα – Ασφάλεια Πληροφοριών Παναγιώτης Βλάμος Μαθηματικά με έμφαση...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Εργαστήρια",
          "url": "/site-gem/gr/groups/",
          "excerpt": "Εργαστήριο Βιοπληροφορικής και Ανθρώπινης Ηλεκτροφυσιολογίας (BIHELab) Το εργαστήριο Βιοπληροφορικής και Ανθρώπινης Ηλεκτροφυσιολογίας καλύπτει τις ερευνητικές δραστηριότητες του Τμήματος Πληροφορικής του...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Τμήμα Πληροφορικής",
          "url": "/site-gem/gr/home/",
          "excerpt": "Ανακοινώσεις Ενημερωθείτε για τα τελευταία νέα του τμήματος Πληροφορικής. Learn More Ερευνητικά Προγράμματα Δείτε όλα τα ερευνητικά προγράμματα του τμήματος...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ανθρωπιστικές Επιστήμες",
          "url": "/site-gem/gr/humanistic/",
          "excerpt": "Γραφικά με Υπολογιστές Βασικές έννοιες γραφικών με υπολογιστές και εφαρμογές τους, Ιστορία και γενικά χαρακτηριστικά, Διανυσματική(ά) / Πλεγματική(ά) απεικόνιση/γραφικά, Εισαγωγικά......",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Index",
          "url": "/site-gem/gr/index/",
          "excerpt": "",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Μαθήματα Μεταπτυχιακού",
          "url": "/site-gem/gr/msc/",
          "excerpt": "ΜΑΘΗΜΑΤΑ A Εξάμηνο Β Εξάμηνο A Εξάμηνο Διοικητική Πληροφοριακών Συστημάτων Α. Αξιοποίηση της πληροφορικής από τους οργανισμούς: Σημασία της πληροφορικής...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Pages",
          "url": "/site-gem/gr/pages/",
          "excerpt": "&lt;h2 id=\"administrative-assistants\" class=\"archive__subtitle\"&gt;&lt;/h2&gt; &lt;h2 id=\"administrative-assistants-en\" class=\"archive__subtitle\"&gt;&lt;/h2&gt; &lt;h2 id=\"courses\" class=\"archive__subtitle\"&gt;&lt;/h2&gt; Τεχνητή Νοημοσύνη Στόχοι της Τεχνητής Νοημοσύνης. Ιστορική Αναδρομή. Προβλήματα και επίλυση....",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ανακοινώσεις",
          "url": "/site-gem/gr/posts/",
          "excerpt": "2016 2ο Παγκόσμιο Συνέδριο GeNeDis 2016 Το 2ο Παγκόσμιο Συνέδριο για την Γενετική, Γηριατρική και την Έρευνα νευροεκφυλιστικών νόσων, το...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Προγράμματα",
          "url": "/site-gem/gr/projects/",
          "excerpt": "Cultural Understanding through Learning and Technology (CULT) Το έργο CULT εστιάζει πάνω στην μελέτη των κοινωνικών επιδράσεων του συστήματος σε...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Αναζήτηση στην ιστοσελίδα",
          "url": "/site-gem/gr/search/",
          "excerpt": "\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Πληροφοριακών Συστημάτων",
          "url": "/site-gem/gr/systems/",
          "excerpt": "Συστήματα Υποστήριξης Αποφάσεων Εισαγωγή στη θεωρία Αποφάσεων, Η φιλοσοφία των Συστημάτων Υποστήριξης Αποφάσεων και ο ρόλος τους στις διαδικασίες λήψης...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ερευνητικά Ενδιαφέροντα του Τμήματος",
          "url": "/site-gem/gr/tags/",
          "excerpt": "XPath) Αντιλήψεις Επικινδυνότητας και Ενημερότητα Χρηστών Ηλεκτρονική Διακυβέρνηση και Πληροφοριακά Συστήματα μηχανική περιβάλλον) Crowdsourcing Αδαμαντία Πατέλη Διοίκηση Πληροφοριακών Συστημάτων και...",
          "teaser":
            
              null
            
        },
      
    
  
    
      
      
      
        
        {
          "title": "Εργαστήριο Βιοπληροφορικής και Ανθρώπινης Ηλεκτροφυσιολογίας (BIHELab)",
          "url": "/site-gem/gr/groups/bihe/",
          "excerpt": "Οι νευροεκφυλιστικές παθήσεις, προσβάλλουν πλέον ένα σημαντικό ποσοστό του πληθυσμού των σύγχρονων δυτικών κοινωνιών. Τα τελευταία χρόνια καταβάλλεται μια συστηματική...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Εργαστήριο Υπολογιστικής Μοντελοποίησης (CMODLab)",
          "url": "/site-gem/gr/groups/cmod/",
          "excerpt": "Οι ερευνητικές δραστηριότητες που υποστηρίζονται από το Εργαστήριο Υπολογιστικής Μοντελοποίησης αφορούν ένα ευρύτατο φάσμα της επιστήμης της Πληροφορικής με έμφαση...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Εργαστήριο Εφαρμογών Πληροφορικής στις Ανθρωπιστικές – Κοινωνικές Επιστήμες (HILab)",
          "url": "/site-gem/gr/groups/hi/",
          "excerpt": "Αφ’ ετέρου χρησιμοποιεί μεθοδολογίες των επιστημών αυτών για να προσδώσει στις υπηρεσίες και τα προϊόντα των νέων τεχνολογιών βέλτιστη ποιότητα...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Εργαστήριο Πληροφορικών Συστημάτων και Βάσεων Δεδομένων (ISDLab)",
          "url": "/site-gem/gr/groups/isd/",
          "excerpt": "Οι επιστημονικές περιοχές που το εργαστήριο κυρίως καλύπτει αφορούν στις ακόλουθες: ανάλυση και σχεδιασμό πληροφοριακών συστημάτων, αξιολόγηση καινοτόμων εφαρμογών πληροφορικής,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Εργαστήριο Δικτύων, Πολυμέσων και Ασφάλειας Συστημάτων (NMSLab)",
          "url": "/site-gem/gr/groups/nms/",
          "excerpt": "Ο εκπαιδευτικός ρόλος του NMSLab είναι να υποστηρίζει τα μαθήματα του προπτυχιακού προγράμματος σπουδών που σχετίζονται με δίκτυα υπολογιστών, συστήματα...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Εργαστήριο Κβαντικών και μή Συμβατικών Υπολογισμών(QUITLab)",
          "url": "/site-gem/gr/groups/quit/",
          "excerpt": "Our current areas of research include: Quantum Automata Automata on infinite inputs Modeling with Membrane automata SPARQL Queries and Finite...",
          "teaser":
            
              null
            
        },
      
    
  
    
  
    
      
      
      
        
        {
          "title": "Διοικητική Πληροφοριακών Συστημάτων",
          "url": "/site-gem/gr/msc/adm-inf-systems/",
          "excerpt": "\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Τεχνητή Νοημοσύνη",
          "url": "/site-gem/gr/msc/ai/",
          "excerpt": "\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Σχεδίαση της Διάδρασης Ανθρώπου-Υπολογιστή",
          "url": "/site-gem/gr/msc/id/",
          "excerpt": "\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Ερευνητικές Μέθοδοι",
          "url": "/site-gem/gr/msc/rm/",
          "excerpt": "\n",
          "teaser":
            
              null
            
        },
      
    
  
    
  
    
      
      
      
        
        {
          "title": "Εγγραφή Πρωτοετών Φοιτητών 2016-2017",
          "url": "/site-gem/gr/posts/2016/09/12/freshman2016-registration/",
          "excerpt": "Για το σκοπό αυτό η Γραμματεία χρειάζεται να έχει: εκτυπωμένη την αίτηση εγγραφής που υποβλήθηκε από τους επιτυχόντες ηλεκτρονικά στην...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Διοργάνωση συνεδρίου του έργου ADRIATinn",
          "url": "/site-gem/gr/posts/2016/09/21/adriatinn-conference/",
          "excerpt": "Το έργο στοχεύει στην προώθηση και υποστήριξη της καινοτομίας μέσω της ανάπτυξης ενός διασυνοριακού οικοσυστήματος το οποίο στηρίζει την συνεχή...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Έναρξη Μαθημάτων Προπτυχιακού",
          "url": "/site-gem/gr/posts/2016/09/28/undergrad-studies2016-start/",
          "excerpt": "Τα μαθήματα του Προπτυχιακού ξεκινούν την Δευτέρα 3 Οκτωβρίου 2016. Το ωρολόγιο πρόγραμμα του 1ου εξαμήνου μπορείτε να το δείτε...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Clifford Kentros Guest Lecture",
          "url": "/site-gem/gr/posts/2016/10/05/kentros-guest-lecture/",
          "excerpt": "Ο Καθηγητής Ιατρικής, Clifford Kentros, που ηγείται ερευνητικής ομάδας των διάσημων Νομπελιστών May-Britt και Edvard Moser (2014), θα επισκεφτεί την...",
          "teaser":
            
              "https://www.ionio.gr/central/images/content/news/08000-08999/IU-ni-08845-77805.jpg"
            
        },
      
        
        {
          "title": "2ο Παγκόσμιο Συνέδριο GeNeDis 2016",
          "url": "/site-gem/gr/posts/2016/10/20/genedis-conference-2016/",
          "excerpt": "Το συνέδριο θα επικεντρωθεί στις πρόσφατες εξελίξεις που αφορούν τους παραπάνω τομείς ξεκινώντας από την πρόοδο στο ερευνητικό πεδίο και...",
          "teaser":
            
              null
            
        },
      
    
  
    
  
    
      
      
      
        
        {
          "title": "Cultural Understanding through Learning and Technology (CULT)",
          "url": "/site-gem/gr/projects/cult/",
          "excerpt": "Οι σχέσεις απομακρυσμένων κοινοτήτων θα μπορούσαν να ενισχυθούν διαμέσου των νέων τεχνολογιών επικοινωνίας από απόσταση (π.χ. WiFi, Bluetooth, Δημόσιες οθόνες,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Discovery Space(D-Space)",
          "url": "/site-gem/gr/projects/d-space/",
          "excerpt": "Το έργο Discovery Space (D-Space) παρέχει τη δυνατότητα πρόσβασης και από κοινού χρήσης εργαλείων και εκπαιδευτικών πηγών όχι μόνο σε...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Μοντελοποίηση της Δυναμικής Αυτοοργάνωσης και της Καταστολής του πληθυσμού του δάκου σε πραγματικό Οικο-Σύστημα του Δήμου Αγίου Γεωργίου, Κέρκυρας(Δάκος)",
          "url": "/site-gem/gr/projects/dakos/",
          "excerpt": "Ο δάκος είναι ο σοβαρότερος εχθρός της ελαιοπαραγωγής, προκαλώντας κάθε χρόνο πολλές σημαντικές οικονομικές ζημιές, τόσο με την υποβάθμιση των...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "ΕΠΕΑΕΚ: ΕΝΘΑΡΡΥΝΣΗ ΕΠΙΧΕΙΡΗΜΑΤΙΚΩΝ ΔΡΑΣΕΩΝ, ΚΑΙΝΟΤΟΜΙΚΩΝ ΕΦΑΡΜΟΓΩΝ ΚΑΙ ΜΑΘΗΜΑΤΩΝ ΕΠΙΛΟΓΗΣ ΦΟΙΤΗΤΩΝ ΚΑΙ ΣΠΟΥΔΑΣΤΩΝ",
          "url": "/site-gem/gr/projects/entrepreneurship/",
          "excerpt": "\n",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Πλατφόρμα για την δια-ακαδημαική συνεργασία στην καινοτομία(PaCiNNo)",
          "url": "/site-gem/gr/projects/pacinno/",
          "excerpt": "Ο στόχος του έργου PACiNNO είναι η δημιουργία μιας πλατφόρμας για τη συνεργασία στον τομέα της έρευνας και της καινοτομίας...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "PromO(nto)tion",
          "url": "/site-gem/gr/projects/promontotion/",
          "excerpt": "ΑΡΧΙΜΗΔΗΣ ΙΙΙ, ΕΣΠΑ 2007-2013 Για την υλοποίηση του εργαλείου θα χρησιμοποιηθούν οι νέες τεχνολογίες, και συγκεκριμένα θα σχεδιαστεί ένα εύχρηστο,...",
          "teaser":
            
              null
            
        },
      
        
        {
          "title": "Μετάφραση για Μαζικά Ανοικτά Διαδικτυακά Μαθήματα(TraMOOC)",
          "url": "/site-gem/gr/projects/tramooc/",
          "excerpt": "Διάρκεια: 01/02/2015 – 31/01/2018 Πρόγραμμα Χρηματοδότησης: Ηorizon 2020 Προϋπολογισμός έργου: 3,270,710.00€ Ο στόχος του έργου είναι η υψηλής ποιότητας αυτόματη...",
          "teaser":
            
              null
            
        },
      
    
  
    
  ]

$(document).ready(function() {
  $('input#search').on('keyup', function () {
    var resultdiv = $('#results');
    var query = $(this).val();
    var result = idx.search(query);
    resultdiv.empty();
    resultdiv.prepend('<p>'+result.length+' Result(s) found</p>');
    for (var item in result) {
      var ref = result[item].ref;
      if(store[ref].teaser){
        var searchitem =
          '<div class="list__item">'+
            '<article class="archive__item" itemscope itemtype="http://schema.org/CreativeWork">'+
              '<h2 class="archive__item-title" itemprop="headline">'+
                '<a href="'+store[ref].url+'" rel="permalink">'+store[ref].title+'</a>'+
              '</h2>'+
              '<div class="archive__item-teaser">'+
                '<img src="'+store[ref].teaser+'" alt="">'+
              '</div>'+
              '<p class="archive__item-excerpt" itemprop="description">'+store[ref].excerpt+'</p>'+
            '</article>'+
          '</div>';
      }
      else{
    	  var searchitem =
          '<div class="list__item">'+
            '<article class="archive__item" itemscope itemtype="http://schema.org/CreativeWork">'+
              '<h2 class="archive__item-title" itemprop="headline">'+
                '<a href="'+store[ref].url+'" rel="permalink">'+store[ref].title+'</a>'+
              '</h2>'+
              '<p class="archive__item-excerpt" itemprop="description">'+store[ref].excerpt+'</p>'+
            '</article>'+
          '</div>';
      }
      resultdiv.append(searchitem);
    }
  });
});
